program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.30.0"}, {"coremlc-version", "1839.0.0"}})]
{
    func main<ios16>(tensor<fp32, [1, 77]> input_ids) {
            tensor<int32, []> var_5 = const()[name = tensor<string, []>("op_5"), val = tensor<int32, []>(-1)];
            tensor<bool, []> var_6 = const()[name = tensor<string, []>("op_6"), val = tensor<bool, []>(false)];
            tensor<string, []> cast_1_dtype_0 = const()[name = tensor<string, []>("cast_1_dtype_0"), val = tensor<string, []>("int32")];
            tensor<int32, []> inputs_embeds_axis_0 = const()[name = tensor<string, []>("inputs_embeds_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> inputs_embeds_batch_dims_0 = const()[name = tensor<string, []>("inputs_embeds_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [49408, 1024]> text_encoder_text_model_embeddings_token_embedding_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_embeddings_token_embedding_weight_to_fp16"), val = tensor<fp16, [49408, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<int32, [1, 77]> cast_2 = cast(dtype = cast_1_dtype_0, x = input_ids)[name = tensor<string, []>("cast_2")];
            tensor<fp16, [1, 77, 1024]> inputs_embeds_cast = gather(axis = inputs_embeds_axis_0, batch_dims = inputs_embeds_batch_dims_0, indices = cast_2, x = text_encoder_text_model_embeddings_token_embedding_weight_to_fp16)[name = tensor<string, []>("inputs_embeds_cast")];
            tensor<fp16, [1, 77, 1024]> position_embeddings_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [59136]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(101187712))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(101246912))), name = tensor<string, []>("position_embeddings_to_fp16_palettized"), shape = tensor<uint32, [3]>([1, 77, 1024])];
            tensor<fp16, [1, 77, 1024]> input_3_cast = add(x = inputs_embeds_cast, y = position_embeddings_to_fp16_palettized)[name = tensor<string, []>("input_3_cast")];
            tensor<int32, [1]> hidden_states_1_axes_0 = const()[name = tensor<string, []>("hidden_states_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm1_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(101247104)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm1_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(101249216)))];
            tensor<fp16, []> var_12_to_fp16 = const()[name = tensor<string, []>("op_12_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 77, 1024]> hidden_states_1_cast = layer_norm(axes = hidden_states_1_axes_0, beta = text_encoder_text_model_encoder_layers_0_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_0_layer_norm1_weight_to_fp16, x = input_3_cast)[name = tensor<string, []>("hidden_states_1_cast")];
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [786432]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(101251328))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(102037824))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([1024, 1024])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(102038016)))];
            tensor<fp16, [1, 77, 1024]> var_109_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16_palettized, x = hidden_states_1_cast)[name = tensor<string, []>("op_109_cast")];
            tensor<fp16, []> var_110_to_fp16 = const()[name = tensor<string, []>("op_110_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 1024]> tensor_5_cast = mul(x = var_109_cast, y = var_110_to_fp16)[name = tensor<string, []>("tensor_5_cast")];
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [786432]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(102040128))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(102826624))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([1024, 1024])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(102826816)))];
            tensor<fp16, [1, 77, 1024]> tensor_1_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16_palettized, x = hidden_states_1_cast)[name = tensor<string, []>("tensor_1_cast")];
            tensor<int32, [4]> var_115 = const()[name = tensor<string, []>("op_115"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_116_cast = reshape(shape = var_115, x = tensor_1_cast)[name = tensor<string, []>("op_116_cast")];
            tensor<int32, [4]> var_117_perm_0 = const()[name = tensor<string, []>("op_117_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [786432]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(102828928))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(103615424))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([1024, 1024])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(103615616)))];
            tensor<fp16, [1, 77, 1024]> tensor_3_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16_palettized, x = hidden_states_1_cast)[name = tensor<string, []>("tensor_3_cast")];
            tensor<int32, [4]> var_122 = const()[name = tensor<string, []>("op_122"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_123_cast = reshape(shape = var_122, x = tensor_3_cast)[name = tensor<string, []>("op_123_cast")];
            tensor<int32, [4]> var_124_perm_0 = const()[name = tensor<string, []>("op_124_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_131 = const()[name = tensor<string, []>("op_131"), val = tensor<int32, [4]>([1, 77, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_132_cast = reshape(shape = var_131, x = tensor_5_cast)[name = tensor<string, []>("op_132_cast")];
            tensor<int32, [4]> var_133_perm_0 = const()[name = tensor<string, []>("op_133_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_135 = const()[name = tensor<string, []>("op_135"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_114 = transpose(perm = var_133_perm_0, x = var_132_cast)[name = tensor<string, []>("transpose_114")];
            tensor<fp16, [16, 77, 64]> query_states_1_cast = reshape(shape = var_135, x = transpose_114)[name = tensor<string, []>("query_states_1_cast")];
            tensor<int32, [3]> var_137 = const()[name = tensor<string, []>("op_137"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_113 = transpose(perm = var_117_perm_0, x = var_116_cast)[name = tensor<string, []>("transpose_113")];
            tensor<fp16, [16, 77, 64]> key_states_3_cast = reshape(shape = var_137, x = transpose_113)[name = tensor<string, []>("key_states_3_cast")];
            tensor<int32, [3]> var_139 = const()[name = tensor<string, []>("op_139"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_112 = transpose(perm = var_124_perm_0, x = var_123_cast)[name = tensor<string, []>("transpose_112")];
            tensor<fp16, [16, 77, 64]> value_states_3_cast = reshape(shape = var_139, x = transpose_112)[name = tensor<string, []>("value_states_3_cast")];
            tensor<int32, [3]> var_142_perm_0 = const()[name = tensor<string, []>("op_142_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_1_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_1_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 64, 77]> transpose_111 = transpose(perm = var_142_perm_0, x = key_states_3_cast)[name = tensor<string, []>("transpose_111")];
            tensor<fp16, [16, 77, 77]> attn_weights_1_cast = matmul(transpose_x = attn_weights_1_transpose_x_0, transpose_y = attn_weights_1_transpose_y_0, x = query_states_1_cast, y = transpose_111)[name = tensor<string, []>("attn_weights_1_cast")];
            tensor<int32, [4]> var_144 = const()[name = tensor<string, []>("op_144"), val = tensor<int32, [4]>([1, 16, 77, 77])];
            tensor<fp16, [1, 16, 77, 77]> var_145_cast = reshape(shape = var_144, x = attn_weights_1_cast)[name = tensor<string, []>("op_145_cast")];
            tensor<fp16, [1, 1, 77, 77]> causal_attention_mask_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [4447]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(103617728))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(103622272))), name = tensor<string, []>("causal_attention_mask_to_fp16_palettized"), shape = tensor<uint32, [4]>([1, 1, 77, 77])];
            tensor<fp16, [1, 16, 77, 77]> attn_weights_3_cast = add(x = var_145_cast, y = causal_attention_mask_to_fp16_palettized)[name = tensor<string, []>("attn_weights_3_cast")];
            tensor<int32, [3]> var_150 = const()[name = tensor<string, []>("op_150"), val = tensor<int32, [3]>([16, 77, 77])];
            tensor<fp16, [16, 77, 77]> input_5_cast = reshape(shape = var_150, x = attn_weights_3_cast)[name = tensor<string, []>("input_5_cast")];
            tensor<fp16, [16, 77, 77]> input_7_cast = softmax(axis = var_5, x = input_5_cast)[name = tensor<string, []>("input_7_cast")];
            tensor<bool, []> attn_output_1_transpose_x_0 = const()[name = tensor<string, []>("attn_output_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_1_transpose_y_0 = const()[name = tensor<string, []>("attn_output_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 77, 64]> attn_output_1_cast = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = input_7_cast, y = value_states_3_cast)[name = tensor<string, []>("attn_output_1_cast")];
            tensor<int32, [4]> var_155 = const()[name = tensor<string, []>("op_155"), val = tensor<int32, [4]>([1, 16, 77, 64])];
            tensor<fp16, [1, 16, 77, 64]> attn_output_3_cast = reshape(shape = var_155, x = attn_output_1_cast)[name = tensor<string, []>("attn_output_3_cast")];
            tensor<int32, [4]> attn_output_5_perm_0 = const()[name = tensor<string, []>("attn_output_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_158 = const()[name = tensor<string, []>("op_158"), val = tensor<int32, [3]>([1, 77, 1024])];
            tensor<fp16, [1, 77, 16, 64]> transpose_110 = transpose(perm = attn_output_5_perm_0, x = attn_output_3_cast)[name = tensor<string, []>("transpose_110")];
            tensor<fp16, [1, 77, 1024]> input_9_cast = reshape(shape = var_158, x = transpose_110)[name = tensor<string, []>("input_9_cast")];
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [786432]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(103622464))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104408960))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([1024, 1024])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104409152)))];
            tensor<fp16, [1, 77, 1024]> hidden_states_3_cast = linear(bias = text_encoder_text_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16_palettized, x = input_9_cast)[name = tensor<string, []>("hidden_states_3_cast")];
            tensor<fp16, [1, 77, 1024]> input_11_cast = add(x = input_3_cast, y = hidden_states_3_cast)[name = tensor<string, []>("input_11_cast")];
            tensor<int32, [1]> input_13_axes_0 = const()[name = tensor<string, []>("input_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm2_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104411264)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_layer_norm2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104413376)))];
            tensor<fp16, [1, 77, 1024]> input_13_cast = layer_norm(axes = input_13_axes_0, beta = text_encoder_text_model_encoder_layers_0_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_0_layer_norm2_weight_to_fp16, x = input_11_cast)[name = tensor<string, []>("input_13_cast")];
            tensor<fp16, [4096, 1024]> text_encoder_text_model_encoder_layers_0_mlp_fc1_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [3145728]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104415488))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(107561280))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc1_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([4096, 1024])];
            tensor<fp16, [4096]> text_encoder_text_model_encoder_layers_0_mlp_fc1_bias_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(107561472))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(107564608))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc1_bias_to_fp16_palettized"), shape = tensor<uint32, [1]>([4096])];
            tensor<fp16, [1, 77, 4096]> input_15_cast = linear(bias = text_encoder_text_model_encoder_layers_0_mlp_fc1_bias_to_fp16_palettized, weight = text_encoder_text_model_encoder_layers_0_mlp_fc1_weight_to_fp16_palettized, x = input_13_cast)[name = tensor<string, []>("input_15_cast")];
            tensor<string, []> input_17_mode_0 = const()[name = tensor<string, []>("input_17_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 77, 4096]> input_17_cast = gelu(mode = input_17_mode_0, x = input_15_cast)[name = tensor<string, []>("input_17_cast")];
            tensor<fp16, [1024, 4096]> text_encoder_text_model_encoder_layers_0_mlp_fc2_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [3145728]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(107564800))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(110710592))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc2_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([1024, 4096])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_0_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_0_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(110710784)))];
            tensor<fp16, [1, 77, 1024]> hidden_states_5_cast = linear(bias = text_encoder_text_model_encoder_layers_0_mlp_fc2_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_0_mlp_fc2_weight_to_fp16_palettized, x = input_17_cast)[name = tensor<string, []>("hidden_states_5_cast")];
            tensor<fp16, [1, 77, 1024]> input_19_cast = add(x = input_11_cast, y = hidden_states_5_cast)[name = tensor<string, []>("input_19_cast")];
            tensor<int32, [1]> hidden_states_7_axes_0 = const()[name = tensor<string, []>("hidden_states_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm1_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(110712896)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm1_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(110715008)))];
            tensor<fp16, [1, 77, 1024]> hidden_states_7_cast = layer_norm(axes = hidden_states_7_axes_0, beta = text_encoder_text_model_encoder_layers_1_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_1_layer_norm1_weight_to_fp16, x = input_19_cast)[name = tensor<string, []>("hidden_states_7_cast")];
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [786432]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(110717120))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(111503616))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([1024, 1024])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(111503808)))];
            tensor<fp16, [1, 77, 1024]> var_196_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16_palettized, x = hidden_states_7_cast)[name = tensor<string, []>("op_196_cast")];
            tensor<fp16, []> var_197_to_fp16 = const()[name = tensor<string, []>("op_197_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 1024]> tensor_11_cast = mul(x = var_196_cast, y = var_197_to_fp16)[name = tensor<string, []>("tensor_11_cast")];
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [786432]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(111505920))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(112292416))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([1024, 1024])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(112292608)))];
            tensor<fp16, [1, 77, 1024]> tensor_7_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16_palettized, x = hidden_states_7_cast)[name = tensor<string, []>("tensor_7_cast")];
            tensor<int32, [4]> var_202 = const()[name = tensor<string, []>("op_202"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_203_cast = reshape(shape = var_202, x = tensor_7_cast)[name = tensor<string, []>("op_203_cast")];
            tensor<int32, [4]> var_204_perm_0 = const()[name = tensor<string, []>("op_204_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [786432]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(112294720))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(113081216))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([1024, 1024])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(113081408)))];
            tensor<fp16, [1, 77, 1024]> tensor_9_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16_palettized, x = hidden_states_7_cast)[name = tensor<string, []>("tensor_9_cast")];
            tensor<int32, [4]> var_209 = const()[name = tensor<string, []>("op_209"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_210_cast = reshape(shape = var_209, x = tensor_9_cast)[name = tensor<string, []>("op_210_cast")];
            tensor<int32, [4]> var_211_perm_0 = const()[name = tensor<string, []>("op_211_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_218 = const()[name = tensor<string, []>("op_218"), val = tensor<int32, [4]>([1, 77, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_219_cast = reshape(shape = var_218, x = tensor_11_cast)[name = tensor<string, []>("op_219_cast")];
            tensor<int32, [4]> var_220_perm_0 = const()[name = tensor<string, []>("op_220_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_222 = const()[name = tensor<string, []>("op_222"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_109 = transpose(perm = var_220_perm_0, x = var_219_cast)[name = tensor<string, []>("transpose_109")];
            tensor<fp16, [16, 77, 64]> query_states_3_cast = reshape(shape = var_222, x = transpose_109)[name = tensor<string, []>("query_states_3_cast")];
            tensor<int32, [3]> var_224 = const()[name = tensor<string, []>("op_224"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_108 = transpose(perm = var_204_perm_0, x = var_203_cast)[name = tensor<string, []>("transpose_108")];
            tensor<fp16, [16, 77, 64]> key_states_7_cast = reshape(shape = var_224, x = transpose_108)[name = tensor<string, []>("key_states_7_cast")];
            tensor<int32, [3]> var_226 = const()[name = tensor<string, []>("op_226"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_107 = transpose(perm = var_211_perm_0, x = var_210_cast)[name = tensor<string, []>("transpose_107")];
            tensor<fp16, [16, 77, 64]> value_states_7_cast = reshape(shape = var_226, x = transpose_107)[name = tensor<string, []>("value_states_7_cast")];
            tensor<int32, [3]> var_229_perm_0 = const()[name = tensor<string, []>("op_229_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_7_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_7_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 64, 77]> transpose_106 = transpose(perm = var_229_perm_0, x = key_states_7_cast)[name = tensor<string, []>("transpose_106")];
            tensor<fp16, [16, 77, 77]> attn_weights_7_cast = matmul(transpose_x = attn_weights_7_transpose_x_0, transpose_y = attn_weights_7_transpose_y_0, x = query_states_3_cast, y = transpose_106)[name = tensor<string, []>("attn_weights_7_cast")];
            tensor<int32, [4]> var_231 = const()[name = tensor<string, []>("op_231"), val = tensor<int32, [4]>([1, 16, 77, 77])];
            tensor<fp16, [1, 16, 77, 77]> var_232_cast = reshape(shape = var_231, x = attn_weights_7_cast)[name = tensor<string, []>("op_232_cast")];
            tensor<fp16, [1, 16, 77, 77]> attn_weights_9_cast = add(x = var_232_cast, y = causal_attention_mask_to_fp16_palettized)[name = tensor<string, []>("attn_weights_9_cast")];
            tensor<int32, [3]> var_237 = const()[name = tensor<string, []>("op_237"), val = tensor<int32, [3]>([16, 77, 77])];
            tensor<fp16, [16, 77, 77]> input_21_cast = reshape(shape = var_237, x = attn_weights_9_cast)[name = tensor<string, []>("input_21_cast")];
            tensor<fp16, [16, 77, 77]> input_23_cast = softmax(axis = var_5, x = input_21_cast)[name = tensor<string, []>("input_23_cast")];
            tensor<bool, []> attn_output_7_transpose_x_0 = const()[name = tensor<string, []>("attn_output_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_7_transpose_y_0 = const()[name = tensor<string, []>("attn_output_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 77, 64]> attn_output_7_cast = matmul(transpose_x = attn_output_7_transpose_x_0, transpose_y = attn_output_7_transpose_y_0, x = input_23_cast, y = value_states_7_cast)[name = tensor<string, []>("attn_output_7_cast")];
            tensor<int32, [4]> var_242 = const()[name = tensor<string, []>("op_242"), val = tensor<int32, [4]>([1, 16, 77, 64])];
            tensor<fp16, [1, 16, 77, 64]> attn_output_9_cast = reshape(shape = var_242, x = attn_output_7_cast)[name = tensor<string, []>("attn_output_9_cast")];
            tensor<int32, [4]> attn_output_11_perm_0 = const()[name = tensor<string, []>("attn_output_11_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_245 = const()[name = tensor<string, []>("op_245"), val = tensor<int32, [3]>([1, 77, 1024])];
            tensor<fp16, [1, 77, 16, 64]> transpose_105 = transpose(perm = attn_output_11_perm_0, x = attn_output_9_cast)[name = tensor<string, []>("transpose_105")];
            tensor<fp16, [1, 77, 1024]> input_25_cast = reshape(shape = var_245, x = transpose_105)[name = tensor<string, []>("input_25_cast")];
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [786432]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(113083520))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(113870016))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([1024, 1024])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(113870208)))];
            tensor<fp16, [1, 77, 1024]> hidden_states_9_cast = linear(bias = text_encoder_text_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16_palettized, x = input_25_cast)[name = tensor<string, []>("hidden_states_9_cast")];
            tensor<fp16, [1, 77, 1024]> input_27_cast = add(x = input_19_cast, y = hidden_states_9_cast)[name = tensor<string, []>("input_27_cast")];
            tensor<int32, [1]> input_29_axes_0 = const()[name = tensor<string, []>("input_29_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm2_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(113872320)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_layer_norm2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(113874432)))];
            tensor<fp16, [1, 77, 1024]> input_29_cast = layer_norm(axes = input_29_axes_0, beta = text_encoder_text_model_encoder_layers_1_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_1_layer_norm2_weight_to_fp16, x = input_27_cast)[name = tensor<string, []>("input_29_cast")];
            tensor<fp16, [4096, 1024]> text_encoder_text_model_encoder_layers_1_mlp_fc1_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [3145728]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(113876544))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117022336))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc1_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([4096, 1024])];
            tensor<fp16, [4096]> text_encoder_text_model_encoder_layers_1_mlp_fc1_bias_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117022528))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117025664))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc1_bias_to_fp16_palettized"), shape = tensor<uint32, [1]>([4096])];
            tensor<fp16, [1, 77, 4096]> input_31_cast = linear(bias = text_encoder_text_model_encoder_layers_1_mlp_fc1_bias_to_fp16_palettized, weight = text_encoder_text_model_encoder_layers_1_mlp_fc1_weight_to_fp16_palettized, x = input_29_cast)[name = tensor<string, []>("input_31_cast")];
            tensor<string, []> input_33_mode_0 = const()[name = tensor<string, []>("input_33_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 77, 4096]> input_33_cast = gelu(mode = input_33_mode_0, x = input_31_cast)[name = tensor<string, []>("input_33_cast")];
            tensor<fp16, [1024, 4096]> text_encoder_text_model_encoder_layers_1_mlp_fc2_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [3145728]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117025856))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(120171648))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc2_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([1024, 4096])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_1_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_1_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(120171840)))];
            tensor<fp16, [1, 77, 1024]> hidden_states_11_cast = linear(bias = text_encoder_text_model_encoder_layers_1_mlp_fc2_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_1_mlp_fc2_weight_to_fp16_palettized, x = input_33_cast)[name = tensor<string, []>("hidden_states_11_cast")];
            tensor<fp16, [1, 77, 1024]> input_35_cast = add(x = input_27_cast, y = hidden_states_11_cast)[name = tensor<string, []>("input_35_cast")];
            tensor<int32, [1]> hidden_states_13_axes_0 = const()[name = tensor<string, []>("hidden_states_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm1_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(120173952)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm1_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(120176064)))];
            tensor<fp16, [1, 77, 1024]> hidden_states_13_cast = layer_norm(axes = hidden_states_13_axes_0, beta = text_encoder_text_model_encoder_layers_2_layer_norm1_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_2_layer_norm1_weight_to_fp16, x = input_35_cast)[name = tensor<string, []>("hidden_states_13_cast")];
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [786432]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(120178176))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(120964672))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([1024, 1024])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(120964864)))];
            tensor<fp16, [1, 77, 1024]> var_283_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16_palettized, x = hidden_states_13_cast)[name = tensor<string, []>("op_283_cast")];
            tensor<fp16, []> var_284_to_fp16 = const()[name = tensor<string, []>("op_284_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 77, 1024]> tensor_17_cast = mul(x = var_283_cast, y = var_284_to_fp16)[name = tensor<string, []>("tensor_17_cast")];
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [786432]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(120966976))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(121753472))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([1024, 1024])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(121753664)))];
            tensor<fp16, [1, 77, 1024]> tensor_13_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16_palettized, x = hidden_states_13_cast)[name = tensor<string, []>("tensor_13_cast")];
            tensor<int32, [4]> var_289 = const()[name = tensor<string, []>("op_289"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_290_cast = reshape(shape = var_289, x = tensor_13_cast)[name = tensor<string, []>("op_290_cast")];
            tensor<int32, [4]> var_291_perm_0 = const()[name = tensor<string, []>("op_291_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [786432]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(121755776))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(122542272))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([1024, 1024])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(122542464)))];
            tensor<fp16, [1, 77, 1024]> tensor_15_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16_palettized, x = hidden_states_13_cast)[name = tensor<string, []>("tensor_15_cast")];
            tensor<int32, [4]> var_296 = const()[name = tensor<string, []>("op_296"), val = tensor<int32, [4]>([1, -1, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_297_cast = reshape(shape = var_296, x = tensor_15_cast)[name = tensor<string, []>("op_297_cast")];
            tensor<int32, [4]> var_298_perm_0 = const()[name = tensor<string, []>("op_298_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> var_305 = const()[name = tensor<string, []>("op_305"), val = tensor<int32, [4]>([1, 77, 16, 64])];
            tensor<fp16, [1, 77, 16, 64]> var_306_cast = reshape(shape = var_305, x = tensor_17_cast)[name = tensor<string, []>("op_306_cast")];
            tensor<int32, [4]> var_307_perm_0 = const()[name = tensor<string, []>("op_307_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_309 = const()[name = tensor<string, []>("op_309"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_104 = transpose(perm = var_307_perm_0, x = var_306_cast)[name = tensor<string, []>("transpose_104")];
            tensor<fp16, [16, 77, 64]> query_states_5_cast = reshape(shape = var_309, x = transpose_104)[name = tensor<string, []>("query_states_5_cast")];
            tensor<int32, [3]> var_311 = const()[name = tensor<string, []>("op_311"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_103 = transpose(perm = var_291_perm_0, x = var_290_cast)[name = tensor<string, []>("transpose_103")];
            tensor<fp16, [16, 77, 64]> key_states_11_cast = reshape(shape = var_311, x = transpose_103)[name = tensor<string, []>("key_states_11_cast")];
            tensor<int32, [3]> var_313 = const()[name = tensor<string, []>("op_313"), val = tensor<int32, [3]>([16, -1, 64])];
            tensor<fp16, [1, 16, 77, 64]> transpose_102 = transpose(perm = var_298_perm_0, x = var_297_cast)[name = tensor<string, []>("transpose_102")];
            tensor<fp16, [16, 77, 64]> value_states_11_cast = reshape(shape = var_313, x = transpose_102)[name = tensor<string, []>("value_states_11_cast")];
            tensor<int32, [3]> var_316_perm_0 = const()[name = tensor<string, []>("op_316_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> attn_weights_13_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_weights_13_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 64, 77]> transpose_101 = transpose(perm = var_316_perm_0, x = key_states_11_cast)[name = tensor<string, []>("transpose_101")];
            tensor<fp16, [16, 77, 77]> attn_weights_13_cast = matmul(transpose_x = attn_weights_13_transpose_x_0, transpose_y = attn_weights_13_transpose_y_0, x = query_states_5_cast, y = transpose_101)[name = tensor<string, []>("attn_weights_13_cast")];
            tensor<int32, [4]> var_318 = const()[name = tensor<string, []>("op_318"), val = tensor<int32, [4]>([1, 16, 77, 77])];
            tensor<fp16, [1, 16, 77, 77]> var_319_cast = reshape(shape = var_318, x = attn_weights_13_cast)[name = tensor<string, []>("op_319_cast")];
            tensor<fp16, [1, 16, 77, 77]> attn_weights_15_cast = add(x = var_319_cast, y = causal_attention_mask_to_fp16_palettized)[name = tensor<string, []>("attn_weights_15_cast")];
            tensor<int32, [3]> var_324 = const()[name = tensor<string, []>("op_324"), val = tensor<int32, [3]>([16, 77, 77])];
            tensor<fp16, [16, 77, 77]> input_37_cast = reshape(shape = var_324, x = attn_weights_15_cast)[name = tensor<string, []>("input_37_cast")];
            tensor<fp16, [16, 77, 77]> input_39_cast = softmax(axis = var_5, x = input_37_cast)[name = tensor<string, []>("input_39_cast")];
            tensor<bool, []> attn_output_13_transpose_x_0 = const()[name = tensor<string, []>("attn_output_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_13_transpose_y_0 = const()[name = tensor<string, []>("attn_output_13_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [16, 77, 64]> attn_output_13_cast = matmul(transpose_x = attn_output_13_transpose_x_0, transpose_y = attn_output_13_transpose_y_0, x = input_39_cast, y = value_states_11_cast)[name = tensor<string, []>("attn_output_13_cast")];
            tensor<int32, [4]> var_329 = const()[name = tensor<string, []>("op_329"), val = tensor<int32, [4]>([1, 16, 77, 64])];
            tensor<fp16, [1, 16, 77, 64]> attn_output_15_cast = reshape(shape = var_329, x = attn_output_13_cast)[name = tensor<string, []>("attn_output_15_cast")];
            tensor<int32, [4]> attn_output_17_perm_0 = const()[name = tensor<string, []>("attn_output_17_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_332 = const()[name = tensor<string, []>("op_332"), val = tensor<int32, [3]>([1, 77, 1024])];
            tensor<fp16, [1, 77, 16, 64]> transpose_100 = transpose(perm = attn_output_17_perm_0, x = attn_output_15_cast)[name = tensor<string, []>("transpose_100")];
            tensor<fp16, [1, 77, 1024]> input_41_cast = reshape(shape = var_332, x = transpose_100)[name = tensor<string, []>("input_41_cast")];
            tensor<fp16, [1024, 1024]> text_encoder_text_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [786432]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(122544576))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(123331072))), name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([1024, 1024])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(123331264)))];
            tensor<fp16, [1, 77, 1024]> hidden_states_15_cast = linear(bias = text_encoder_text_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16, weight = text_encoder_text_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16_palettized, x = input_41_cast)[name = tensor<string, []>("hidden_states_15_cast")];
            tensor<fp16, [1, 77, 1024]> input_43_cast = add(x = input_35_cast, y = hidden_states_15_cast)[name = tensor<string, []>("input_43_cast")];
            tensor<int32, [1]> input_45_axes_0 = const()[name = tensor<string, []>("input_45_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm2_weight_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(123333376)))];
            tensor<fp16, [1024]> text_encoder_text_model_encoder_layers_2_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("text_encoder_text_model_encoder_layers_2_layer_norm2_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(123335488)))];
            tensor<fp16, [1, 77, 1024]> input_45_cast = layer_norm(axes = input_45_axes_0, beta = text_encoder_text_model_encoder_layers_2_layer_norm2_bias_to_fp16, epsilon = var_12_to_fp16, gamma = text_encoder_text_model_encoder_layers_2_layer_norm2_weight_to_fp16, x = input_43_cast)[name = tensor<string, []>("input_45_cast")];
