program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.30.0"}, {"coremlc-version", "1839.0.0"}})]
{
    func main<ios16>(tensor<fp16, [2, 1024, 1, 77]> encoder_hidden_states, tensor<fp16, [2, 4, 64, 64]> sample, tensor<fp16, [2]> timestep) {
            tensor<int32, []> var_25 = const()[name = tensor<string, []>("op_25"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_42_axes_0 = const()[name = tensor<string, []>("op_42_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [2, 1]> var_42_cast = expand_dims(axes = var_42_axes_0, x = timestep)[name = tensor<string, []>("op_42_cast")];
            tensor<fp16, [1, 160]> var_44_to_fp16 = const()[name = tensor<string, []>("op_44_to_fp16"), val = tensor<fp16, [1, 160]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [2, 160]> emb_3_cast = mul(x = var_42_cast, y = var_44_to_fp16)[name = tensor<string, []>("emb_3_cast")];
            tensor<fp16, [2, 160]> var_49_cast = sin(x = emb_3_cast)[name = tensor<string, []>("op_49_cast")];
            tensor<fp16, [2, 160]> var_50_cast = cos(x = emb_3_cast)[name = tensor<string, []>("op_50_cast")];
            tensor<bool, []> emb_interleave_0 = const()[name = tensor<string, []>("emb_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 320]> emb_cast = concat(axis = var_25, interleave = emb_interleave_0, values = (var_49_cast, var_50_cast))[name = tensor<string, []>("emb_cast")];
            tensor<int32, [2]> var_54_begin_0 = const()[name = tensor<string, []>("op_54_begin_0"), val = tensor<int32, [2]>([0, 160])];
            tensor<int32, [2]> var_54_end_0 = const()[name = tensor<string, []>("op_54_end_0"), val = tensor<int32, [2]>([2, 320])];
            tensor<bool, [2]> var_54_end_mask_0 = const()[name = tensor<string, []>("op_54_end_mask_0"), val = tensor<bool, [2]>([true, true])];
            tensor<fp16, [2, 160]> var_54_cast = slice_by_index(begin = var_54_begin_0, end = var_54_end_0, end_mask = var_54_end_mask_0, x = emb_cast)[name = tensor<string, []>("op_54_cast")];
            tensor<int32, [2]> var_56_begin_0 = const()[name = tensor<string, []>("op_56_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [2]> var_56_end_0 = const()[name = tensor<string, []>("op_56_end_0"), val = tensor<int32, [2]>([2, 160])];
            tensor<bool, [2]> var_56_end_mask_0 = const()[name = tensor<string, []>("op_56_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [2, 160]> var_56_cast = slice_by_index(begin = var_56_begin_0, end = var_56_end_0, end_mask = var_56_end_mask_0, x = emb_cast)[name = tensor<string, []>("op_56_cast")];
            tensor<bool, []> sample_interleave_0 = const()[name = tensor<string, []>("sample_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 320]> sample_cast = concat(axis = var_25, interleave = sample_interleave_0, values = (var_54_cast, var_56_cast))[name = tensor<string, []>("sample_cast")];
            tensor<int32, []> var_59 = const()[name = tensor<string, []>("op_59"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> var_66_axes_0 = const()[name = tensor<string, []>("op_66_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [2, 320, 1]> var_66_cast = expand_dims(axes = var_66_axes_0, x = sample_cast)[name = tensor<string, []>("op_66_cast")];
            tensor<int32, [1]> input_1_axes_0 = const()[name = tensor<string, []>("input_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [2, 320, 1, 1]> input_1_cast = expand_dims(axes = input_1_axes_0, x = var_66_cast)[name = tensor<string, []>("input_1_cast")];
            tensor<int32, [2]> var_70 = const()[name = tensor<string, []>("op_70"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_72 = const()[name = tensor<string, []>("op_72"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 320, 1, 1]> time_embedding_linear_1_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [307200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(448))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(307712))), name = tensor<string, []>("time_embedding_linear_1_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 320, 1, 1])];
            tensor<fp16, [1280]> time_embedding_linear_1_bias_to_fp16 = const()[name = tensor<string, []>("time_embedding_linear_1_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(307904)))];
            tensor<fp16, [2, 1280, 1, 1]> input_3_cast = conv(bias = time_embedding_linear_1_bias_to_fp16, dilations = var_72, groups = var_59, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = var_70, weight = time_embedding_linear_1_weight_to_fp16_palettized, x = input_1_cast)[name = tensor<string, []>("input_3_cast")];
            tensor<fp16, [2, 1280, 1, 1]> input_5_cast = silu(x = input_3_cast)[name = tensor<string, []>("input_5_cast")];
            tensor<int32, [2]> var_78 = const()[name = tensor<string, []>("op_78"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_80 = const()[name = tensor<string, []>("op_80"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> time_embedding_linear_2_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [1228800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(310528))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1539392))), name = tensor<string, []>("time_embedding_linear_2_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> time_embedding_linear_2_bias_to_fp16 = const()[name = tensor<string, []>("time_embedding_linear_2_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1539584)))];
            tensor<fp16, [2, 1280, 1, 1]> input_13_cast = conv(bias = time_embedding_linear_2_bias_to_fp16, dilations = var_80, groups = var_59, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = var_78, weight = time_embedding_linear_2_weight_to_fp16_palettized, x = input_5_cast)[name = tensor<string, []>("input_13_cast")];
            tensor<int32, []> var_86 = const()[name = tensor<string, []>("op_86"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_89 = const()[name = tensor<string, []>("op_89"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_91 = const()[name = tensor<string, []>("op_91"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [320, 4, 3, 3]> conv_in_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [8640]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1542208))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1550912))), name = tensor<string, []>("conv_in_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 4, 3, 3])];
            tensor<fp16, [320]> conv_in_bias_to_fp16 = const()[name = tensor<string, []>("conv_in_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1551104)))];
            tensor<fp16, [2, 320, 64, 64]> input_7_cast = conv(bias = conv_in_bias_to_fp16, dilations = var_91, groups = var_86, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = var_89, weight = conv_in_weight_to_fp16_palettized, x = sample)[name = tensor<string, []>("input_7_cast")];
            tensor<int32, []> var_95 = const()[name = tensor<string, []>("op_95"), val = tensor<int32, []>(3)];
            tensor<bool, []> var_106 = const()[name = tensor<string, []>("op_106"), val = tensor<bool, []>(true)];
            tensor<int32, []> var_111 = const()[name = tensor<string, []>("op_111"), val = tensor<int32, []>(1)];
            tensor<int32, [5]> reshape_0_shape_0 = const()[name = tensor<string, []>("reshape_0_shape_0"), val = tensor<int32, [5]>([2, 32, 10, 64, 64])];
            tensor<fp16, [2, 32, 10, 64, 64]> reshape_0_cast = reshape(shape = reshape_0_shape_0, x = input_7_cast)[name = tensor<string, []>("reshape_0_cast")];
            tensor<int32, [3]> reduce_mean_0_axes_0 = const()[name = tensor<string, []>("reduce_mean_0_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_0_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_0_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_0_cast = reduce_mean(axes = reduce_mean_0_axes_0, keep_dims = reduce_mean_0_keep_dims_0, x = reshape_0_cast)[name = tensor<string, []>("reduce_mean_0_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> sub_0_cast = sub(x = reshape_0_cast, y = reduce_mean_0_cast)[name = tensor<string, []>("sub_0_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> square_0_cast = square(x = sub_0_cast)[name = tensor<string, []>("square_0_cast")];
            tensor<int32, [3]> reduce_mean_2_axes_0 = const()[name = tensor<string, []>("reduce_mean_2_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_2_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_2_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_2_cast = reduce_mean(axes = reduce_mean_2_axes_0, keep_dims = reduce_mean_2_keep_dims_0, x = square_0_cast)[name = tensor<string, []>("reduce_mean_2_cast")];
            tensor<fp16, []> add_0_y_0_to_fp16 = const()[name = tensor<string, []>("add_0_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_0_cast = add(x = reduce_mean_2_cast, y = add_0_y_0_to_fp16)[name = tensor<string, []>("add_0_cast")];
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_0_cast = sqrt(x = add_0_cast)[name = tensor<string, []>("sqrt_0_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> real_div_0_cast = real_div(x = sub_0_cast, y = sqrt_0_cast)[name = tensor<string, []>("real_div_0_cast")];
            tensor<int32, [4]> reshape_1_shape_0 = const()[name = tensor<string, []>("reshape_1_shape_0"), val = tensor<int32, [4]>([2, 320, 64, 64])];
            tensor<fp16, [2, 320, 64, 64]> reshape_1_cast = reshape(shape = reshape_1_shape_0, x = real_div_0_cast)[name = tensor<string, []>("reshape_1_cast")];
            tensor<fp16, [320]> add_1_mean_0_to_fp16 = const()[name = tensor<string, []>("add_1_mean_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1551808)))];
            tensor<fp16, [320]> add_1_variance_0_to_fp16 = const()[name = tensor<string, []>("add_1_variance_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1552512)))];
            tensor<fp16, [320]> add_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_1_gamma_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1553216)))];
            tensor<fp16, [320]> add_1_beta_0_to_fp16 = const()[name = tensor<string, []>("add_1_beta_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1553920)))];
            tensor<fp16, []> add_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 320, 64, 64]> add_1_cast = batch_norm(beta = add_1_beta_0_to_fp16, epsilon = add_1_epsilon_0_to_fp16, gamma = add_1_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_1_cast)[name = tensor<string, []>("add_1_cast")];
            tensor<fp16, [2, 320, 64, 64]> input_11_cast = silu(x = add_1_cast)[name = tensor<string, []>("input_11_cast")];
            tensor<int32, [2]> var_133 = const()[name = tensor<string, []>("op_133"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_135 = const()[name = tensor<string, []>("op_135"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_1_pad_type_0 = const()[name = tensor<string, []>("hidden_states_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_1_pad_0 = const()[name = tensor<string, []>("hidden_states_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [320, 320, 3, 3]> down_blocks_0_resnets_0_conv1_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [691200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1554624))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2245888))), name = tensor<string, []>("down_blocks_0_resnets_0_conv1_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 320, 3, 3])];
            tensor<fp16, [320]> down_blocks_0_resnets_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_conv1_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2246080)))];
            tensor<fp16, [2, 320, 64, 64]> hidden_states_1_cast = conv(bias = down_blocks_0_resnets_0_conv1_bias_to_fp16, dilations = var_135, groups = var_111, pad = hidden_states_1_pad_0, pad_type = hidden_states_1_pad_type_0, strides = var_133, weight = down_blocks_0_resnets_0_conv1_weight_to_fp16_palettized, x = input_11_cast)[name = tensor<string, []>("hidden_states_1_cast")];
            tensor<fp16, [2, 1280, 1, 1]> input_15_cast = silu(x = input_13_cast)[name = tensor<string, []>("input_15_cast")];
            tensor<int32, [2]> var_141 = const()[name = tensor<string, []>("op_141"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_143 = const()[name = tensor<string, []>("op_143"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> temb_1_pad_type_0 = const()[name = tensor<string, []>("temb_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> temb_1_pad_0 = const()[name = tensor<string, []>("temb_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 1280, 1, 1]> down_blocks_0_resnets_0_time_emb_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [307200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2246784))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2554048))), name = tensor<string, []>("down_blocks_0_resnets_0_time_emb_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 1280, 1, 1])];
            tensor<fp16, [320]> down_blocks_0_resnets_0_time_emb_proj_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_time_emb_proj_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2554240)))];
            tensor<fp16, [2, 320, 1, 1]> temb_1_cast = conv(bias = down_blocks_0_resnets_0_time_emb_proj_bias_to_fp16, dilations = var_143, groups = var_111, pad = temb_1_pad_0, pad_type = temb_1_pad_type_0, strides = var_141, weight = down_blocks_0_resnets_0_time_emb_proj_weight_to_fp16_palettized, x = input_15_cast)[name = tensor<string, []>("temb_1_cast")];
            tensor<fp16, [2, 320, 64, 64]> input_17_cast = add(x = hidden_states_1_cast, y = temb_1_cast)[name = tensor<string, []>("input_17_cast")];
            tensor<int32, [5]> reshape_4_shape_0 = const()[name = tensor<string, []>("reshape_4_shape_0"), val = tensor<int32, [5]>([2, 32, 10, 64, 64])];
            tensor<fp16, [2, 32, 10, 64, 64]> reshape_4_cast = reshape(shape = reshape_4_shape_0, x = input_17_cast)[name = tensor<string, []>("reshape_4_cast")];
            tensor<int32, [3]> reduce_mean_3_axes_0 = const()[name = tensor<string, []>("reduce_mean_3_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_3_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_3_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_3_cast = reduce_mean(axes = reduce_mean_3_axes_0, keep_dims = reduce_mean_3_keep_dims_0, x = reshape_4_cast)[name = tensor<string, []>("reduce_mean_3_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> sub_2_cast = sub(x = reshape_4_cast, y = reduce_mean_3_cast)[name = tensor<string, []>("sub_2_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> square_1_cast = square(x = sub_2_cast)[name = tensor<string, []>("square_1_cast")];
            tensor<int32, [3]> reduce_mean_5_axes_0 = const()[name = tensor<string, []>("reduce_mean_5_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_5_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_5_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_5_cast = reduce_mean(axes = reduce_mean_5_axes_0, keep_dims = reduce_mean_5_keep_dims_0, x = square_1_cast)[name = tensor<string, []>("reduce_mean_5_cast")];
            tensor<fp16, []> add_2_y_0_to_fp16 = const()[name = tensor<string, []>("add_2_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_2_cast = add(x = reduce_mean_5_cast, y = add_2_y_0_to_fp16)[name = tensor<string, []>("add_2_cast")];
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_1_cast = sqrt(x = add_2_cast)[name = tensor<string, []>("sqrt_1_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> real_div_1_cast = real_div(x = sub_2_cast, y = sqrt_1_cast)[name = tensor<string, []>("real_div_1_cast")];
            tensor<int32, [4]> reshape_5_shape_0 = const()[name = tensor<string, []>("reshape_5_shape_0"), val = tensor<int32, [4]>([2, 320, 64, 64])];
            tensor<fp16, [2, 320, 64, 64]> reshape_5_cast = reshape(shape = reshape_5_shape_0, x = real_div_1_cast)[name = tensor<string, []>("reshape_5_cast")];
            tensor<fp16, [320]> add_3_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_3_gamma_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2554944)))];
            tensor<fp16, [320]> add_3_beta_0_to_fp16 = const()[name = tensor<string, []>("add_3_beta_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2555648)))];
            tensor<fp16, []> add_3_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_3_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 320, 64, 64]> add_3_cast = batch_norm(beta = add_3_beta_0_to_fp16, epsilon = add_3_epsilon_0_to_fp16, gamma = add_3_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_5_cast)[name = tensor<string, []>("add_3_cast")];
            tensor<fp16, [2, 320, 64, 64]> input_21_cast = silu(x = add_3_cast)[name = tensor<string, []>("input_21_cast")];
            tensor<int32, [2]> var_153 = const()[name = tensor<string, []>("op_153"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_155 = const()[name = tensor<string, []>("op_155"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_3_pad_type_0 = const()[name = tensor<string, []>("hidden_states_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_3_pad_0 = const()[name = tensor<string, []>("hidden_states_3_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [320, 320, 3, 3]> down_blocks_0_resnets_0_conv2_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [691200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2556352))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3247616))), name = tensor<string, []>("down_blocks_0_resnets_0_conv2_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 320, 3, 3])];
            tensor<fp16, [320]> down_blocks_0_resnets_0_conv2_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_conv2_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3247808)))];
            tensor<fp16, [2, 320, 64, 64]> hidden_states_3_cast = conv(bias = down_blocks_0_resnets_0_conv2_bias_to_fp16, dilations = var_155, groups = var_111, pad = hidden_states_3_pad_0, pad_type = hidden_states_3_pad_type_0, strides = var_153, weight = down_blocks_0_resnets_0_conv2_weight_to_fp16_palettized, x = input_21_cast)[name = tensor<string, []>("hidden_states_3_cast")];
            tensor<fp16, [2, 320, 64, 64]> hidden_states_5_cast = add(x = input_7_cast, y = hidden_states_3_cast)[name = tensor<string, []>("hidden_states_5_cast")];
            tensor<int32, [5]> reshape_8_shape_0 = const()[name = tensor<string, []>("reshape_8_shape_0"), val = tensor<int32, [5]>([2, 32, 10, 64, 64])];
            tensor<fp16, [2, 32, 10, 64, 64]> reshape_8_cast = reshape(shape = reshape_8_shape_0, x = hidden_states_5_cast)[name = tensor<string, []>("reshape_8_cast")];
            tensor<int32, [3]> reduce_mean_6_axes_0 = const()[name = tensor<string, []>("reduce_mean_6_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_6_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_6_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_6_cast = reduce_mean(axes = reduce_mean_6_axes_0, keep_dims = reduce_mean_6_keep_dims_0, x = reshape_8_cast)[name = tensor<string, []>("reduce_mean_6_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> sub_4_cast = sub(x = reshape_8_cast, y = reduce_mean_6_cast)[name = tensor<string, []>("sub_4_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> square_2_cast = square(x = sub_4_cast)[name = tensor<string, []>("square_2_cast")];
            tensor<int32, [3]> reduce_mean_8_axes_0 = const()[name = tensor<string, []>("reduce_mean_8_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_8_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_8_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_8_cast = reduce_mean(axes = reduce_mean_8_axes_0, keep_dims = reduce_mean_8_keep_dims_0, x = square_2_cast)[name = tensor<string, []>("reduce_mean_8_cast")];
            tensor<fp16, []> add_4_y_0_to_fp16 = const()[name = tensor<string, []>("add_4_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_4_cast = add(x = reduce_mean_8_cast, y = add_4_y_0_to_fp16)[name = tensor<string, []>("add_4_cast")];
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_2_cast = sqrt(x = add_4_cast)[name = tensor<string, []>("sqrt_2_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> real_div_2_cast = real_div(x = sub_4_cast, y = sqrt_2_cast)[name = tensor<string, []>("real_div_2_cast")];
            tensor<int32, [4]> reshape_9_shape_0 = const()[name = tensor<string, []>("reshape_9_shape_0"), val = tensor<int32, [4]>([2, 320, 64, 64])];
            tensor<fp16, [2, 320, 64, 64]> reshape_9_cast = reshape(shape = reshape_9_shape_0, x = real_div_2_cast)[name = tensor<string, []>("reshape_9_cast")];
            tensor<fp16, [320]> add_5_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_5_gamma_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3248512)))];
            tensor<fp16, [320]> add_5_beta_0_to_fp16 = const()[name = tensor<string, []>("add_5_beta_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3249216)))];
            tensor<fp16, []> add_5_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_5_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 320, 64, 64]> add_5_cast = batch_norm(beta = add_5_beta_0_to_fp16, epsilon = add_5_epsilon_0_to_fp16, gamma = add_5_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_9_cast)[name = tensor<string, []>("add_5_cast")];
            tensor<int32, [2]> var_175 = const()[name = tensor<string, []>("op_175"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_177 = const()[name = tensor<string, []>("op_177"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_7_pad_type_0 = const()[name = tensor<string, []>("hidden_states_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_7_pad_0 = const()[name = tensor<string, []>("hidden_states_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 320, 1, 1]> down_blocks_0_attentions_0_proj_in_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [76800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3249920))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3326784))), name = tensor<string, []>("down_blocks_0_attentions_0_proj_in_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 320, 1, 1])];
            tensor<fp16, [320]> down_blocks_0_attentions_0_proj_in_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_attentions_0_proj_in_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3326976)))];
            tensor<fp16, [2, 320, 64, 64]> hidden_states_7_cast = conv(bias = down_blocks_0_attentions_0_proj_in_bias_to_fp16, dilations = var_177, groups = var_111, pad = hidden_states_7_pad_0, pad_type = hidden_states_7_pad_type_0, strides = var_175, weight = down_blocks_0_attentions_0_proj_in_weight_to_fp16_palettized, x = add_5_cast)[name = tensor<string, []>("hidden_states_7_cast")];
            tensor<int32, [4]> var_182 = const()[name = tensor<string, []>("op_182"), val = tensor<int32, [4]>([2, 320, 1, 4096])];
            tensor<fp16, [2, 320, 1, 4096]> inputs_1_cast = reshape(shape = var_182, x = hidden_states_7_cast)[name = tensor<string, []>("inputs_1_cast")];
            tensor<int32, [1]> var_192 = const()[name = tensor<string, []>("op_192"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [2, 1, 1, 4096]> channels_mean_1_cast = reduce_mean(axes = var_192, keep_dims = var_106, x = inputs_1_cast)[name = tensor<string, []>("channels_mean_1_cast")];
            tensor<fp16, [2, 320, 1, 4096]> zero_mean_1_cast = sub(x = inputs_1_cast, y = channels_mean_1_cast)[name = tensor<string, []>("zero_mean_1_cast")];
            tensor<fp16, [2, 320, 1, 4096]> zero_mean_sq_1_cast = mul(x = zero_mean_1_cast, y = zero_mean_1_cast)[name = tensor<string, []>("zero_mean_sq_1_cast")];
            tensor<int32, [1]> var_196 = const()[name = tensor<string, []>("op_196"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [2, 1, 1, 4096]> var_197_cast = reduce_mean(axes = var_196, keep_dims = var_106, x = zero_mean_sq_1_cast)[name = tensor<string, []>("op_197_cast")];
            tensor<fp16, []> var_198_to_fp16 = const()[name = tensor<string, []>("op_198_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 1, 1, 4096]> var_199_cast = add(x = var_197_cast, y = var_198_to_fp16)[name = tensor<string, []>("op_199_cast")];
            tensor<fp16, []> denom_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("denom_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [2, 1, 1, 4096]> denom_1_cast = rsqrt(epsilon = denom_1_epsilon_0_to_fp16, x = var_199_cast)[name = tensor<string, []>("denom_1_cast")];
            tensor<fp16, [2, 320, 1, 4096]> out_1_cast = mul(x = zero_mean_1_cast, y = denom_1_cast)[name = tensor<string, []>("out_1_cast")];
            tensor<fp16, [1, 320, 1, 1]> var_203_to_fp16 = const()[name = tensor<string, []>("op_203_to_fp16"), val = tensor<fp16, [1, 320, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3327680)))];
            tensor<fp16, [2, 320, 1, 4096]> var_204_cast = add(x = out_1_cast, y = var_203_to_fp16)[name = tensor<string, []>("op_204_cast")];
            tensor<fp16, [1, 320, 1, 1]> var_206_to_fp16 = const()[name = tensor<string, []>("op_206_to_fp16"), val = tensor<fp16, [1, 320, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3328384)))];
            tensor<fp16, [2, 320, 1, 4096]> hidden_states_9_cast = mul(x = var_204_cast, y = var_206_to_fp16)[name = tensor<string, []>("hidden_states_9_cast")];
            tensor<int32, [2]> var_213 = const()[name = tensor<string, []>("op_213"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_215 = const()[name = tensor<string, []>("op_215"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> q_1_pad_type_0 = const()[name = tensor<string, []>("q_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> q_1_pad_0 = const()[name = tensor<string, []>("q_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 320, 1, 1]> down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_q_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [76800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3329088))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3405952))), name = tensor<string, []>("down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_q_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 320, 1, 1])];
            tensor<fp16, [2, 320, 1, 4096]> q_1_cast = conv(dilations = var_215, groups = var_111, pad = q_1_pad_0, pad_type = q_1_pad_type_0, strides = var_213, weight = down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_q_weight_to_fp16_palettized, x = hidden_states_9_cast)[name = tensor<string, []>("q_1_cast")];
            tensor<int32, [2]> var_219 = const()[name = tensor<string, []>("op_219"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_221 = const()[name = tensor<string, []>("op_221"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> k_1_pad_type_0 = const()[name = tensor<string, []>("k_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> k_1_pad_0 = const()[name = tensor<string, []>("k_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 320, 1, 1]> down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_k_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [76800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3406144))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3483008))), name = tensor<string, []>("down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_k_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 320, 1, 1])];
            tensor<fp16, [2, 320, 1, 4096]> k_1_cast = conv(dilations = var_221, groups = var_111, pad = k_1_pad_0, pad_type = k_1_pad_type_0, strides = var_219, weight = down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_k_weight_to_fp16_palettized, x = hidden_states_9_cast)[name = tensor<string, []>("k_1_cast")];
            tensor<int32, [2]> var_225 = const()[name = tensor<string, []>("op_225"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_227 = const()[name = tensor<string, []>("op_227"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> v_1_pad_type_0 = const()[name = tensor<string, []>("v_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> v_1_pad_0 = const()[name = tensor<string, []>("v_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 320, 1, 1]> down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_v_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [76800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3483200))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3560064))), name = tensor<string, []>("down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_v_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 320, 1, 1])];
            tensor<fp16, [2, 320, 1, 4096]> v_1_cast = conv(dilations = var_227, groups = var_111, pad = v_1_pad_0, pad_type = v_1_pad_type_0, strides = var_225, weight = down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_v_weight_to_fp16_palettized, x = hidden_states_9_cast)[name = tensor<string, []>("v_1_cast")];
            tensor<int32, [4]> var_231 = const()[name = tensor<string, []>("op_231"), val = tensor<int32, [4]>([2, 5, 64, -1])];
            tensor<fp16, [2, 5, 64, 4096]> var_232_cast = reshape(shape = var_231, x = q_1_cast)[name = tensor<string, []>("op_232_cast")];
            tensor<int32, [4]> var_233 = const()[name = tensor<string, []>("op_233"), val = tensor<int32, [4]>([2, 5, 64, -1])];
            tensor<fp16, [2, 5, 64, 4096]> var_234_cast = reshape(shape = var_233, x = k_1_cast)[name = tensor<string, []>("op_234_cast")];
            tensor<int32, [4]> var_235 = const()[name = tensor<string, []>("op_235"), val = tensor<int32, [4]>([2, 5, 64, -1])];
            tensor<fp16, [2, 5, 64, 4096]> var_236_cast = reshape(shape = var_235, x = v_1_cast)[name = tensor<string, []>("op_236_cast")];
            tensor<bool, []> attn_weights_1_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_1_transpose_x_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> attn_weights_1_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 5, 4096, 4096]> attn_weights_1_cast = matmul(transpose_x = attn_weights_1_transpose_x_0, transpose_y = attn_weights_1_transpose_y_0, x = var_232_cast, y = var_234_cast)[name = tensor<string, []>("attn_weights_1_cast")];
            tensor<fp16, []> var_102_to_fp16 = const()[name = tensor<string, []>("op_102_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [2, 5, 4096, 4096]> attn_weights_3_cast = mul(x = attn_weights_1_cast, y = var_102_to_fp16)[name = tensor<string, []>("attn_weights_3_cast")];
            tensor<fp16, [2, 5, 4096, 4096]> var_240_cast = softmax(axis = var_95, x = attn_weights_3_cast)[name = tensor<string, []>("op_240_cast")];
            tensor<bool, []> attn_1_transpose_x_0 = const()[name = tensor<string, []>("attn_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_1_transpose_y_0 = const()[name = tensor<string, []>("attn_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 5, 64, 4096]> attn_1_cast = matmul(transpose_x = attn_1_transpose_x_0, transpose_y = attn_1_transpose_y_0, x = var_236_cast, y = var_240_cast)[name = tensor<string, []>("attn_1_cast")];
            tensor<int32, [4]> var_244 = const()[name = tensor<string, []>("op_244"), val = tensor<int32, [4]>([2, 320, 1, -1])];
            tensor<fp16, [2, 320, 1, 4096]> input_25_cast = reshape(shape = var_244, x = attn_1_cast)[name = tensor<string, []>("input_25_cast")];
            tensor<int32, [2]> var_249 = const()[name = tensor<string, []>("op_249"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_251 = const()[name = tensor<string, []>("op_251"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> var_253_pad_type_0 = const()[name = tensor<string, []>("op_253_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_253_pad_0 = const()[name = tensor<string, []>("op_253_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 320, 1, 1]> down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_out_0_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [76800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3560256))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3637120))), name = tensor<string, []>("down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_out_0_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 320, 1, 1])];
            tensor<fp16, [320]> down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_out_0_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_out_0_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3637312)))];
            tensor<fp16, [2, 320, 1, 4096]> var_253_cast = conv(bias = down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_out_0_bias_to_fp16, dilations = var_251, groups = var_111, pad = var_253_pad_0, pad_type = var_253_pad_type_0, strides = var_249, weight = down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_out_0_weight_to_fp16_palettized, x = input_25_cast)[name = tensor<string, []>("op_253_cast")];
            tensor<fp16, [2, 320, 1, 4096]> inputs_3_cast = add(x = var_253_cast, y = inputs_1_cast)[name = tensor<string, []>("inputs_3_cast")];
            tensor<int32, [1]> var_257 = const()[name = tensor<string, []>("op_257"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [2, 1, 1, 4096]> channels_mean_3_cast = reduce_mean(axes = var_257, keep_dims = var_106, x = inputs_3_cast)[name = tensor<string, []>("channels_mean_3_cast")];
            tensor<fp16, [2, 320, 1, 4096]> zero_mean_3_cast = sub(x = inputs_3_cast, y = channels_mean_3_cast)[name = tensor<string, []>("zero_mean_3_cast")];
            tensor<fp16, [2, 320, 1, 4096]> zero_mean_sq_3_cast = mul(x = zero_mean_3_cast, y = zero_mean_3_cast)[name = tensor<string, []>("zero_mean_sq_3_cast")];
            tensor<int32, [1]> var_261 = const()[name = tensor<string, []>("op_261"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [2, 1, 1, 4096]> var_262_cast = reduce_mean(axes = var_261, keep_dims = var_106, x = zero_mean_sq_3_cast)[name = tensor<string, []>("op_262_cast")];
            tensor<fp16, []> var_263_to_fp16 = const()[name = tensor<string, []>("op_263_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 1, 1, 4096]> var_264_cast = add(x = var_262_cast, y = var_263_to_fp16)[name = tensor<string, []>("op_264_cast")];
            tensor<fp16, []> denom_3_epsilon_0_to_fp16 = const()[name = tensor<string, []>("denom_3_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [2, 1, 1, 4096]> denom_3_cast = rsqrt(epsilon = denom_3_epsilon_0_to_fp16, x = var_264_cast)[name = tensor<string, []>("denom_3_cast")];
            tensor<fp16, [2, 320, 1, 4096]> out_3_cast = mul(x = zero_mean_3_cast, y = denom_3_cast)[name = tensor<string, []>("out_3_cast")];
            tensor<fp16, [1, 320, 1, 1]> var_268_to_fp16 = const()[name = tensor<string, []>("op_268_to_fp16"), val = tensor<fp16, [1, 320, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3638016)))];
            tensor<fp16, [2, 320, 1, 4096]> var_269_cast = add(x = out_3_cast, y = var_268_to_fp16)[name = tensor<string, []>("op_269_cast")];
            tensor<fp16, [1, 320, 1, 1]> var_271_to_fp16 = const()[name = tensor<string, []>("op_271_to_fp16"), val = tensor<fp16, [1, 320, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3638720)))];
            tensor<fp16, [2, 320, 1, 4096]> hidden_states_11_cast = mul(x = var_269_cast, y = var_271_to_fp16)[name = tensor<string, []>("hidden_states_11_cast")];
            tensor<int32, [2]> var_278 = const()[name = tensor<string, []>("op_278"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_280 = const()[name = tensor<string, []>("op_280"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> q_3_pad_type_0 = const()[name = tensor<string, []>("q_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> q_3_pad_0 = const()[name = tensor<string, []>("q_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 320, 1, 1]> down_blocks_0_attentions_0_transformer_blocks_0_attn2_to_q_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [76800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3639424))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3716288))), name = tensor<string, []>("down_blocks_0_attentions_0_transformer_blocks_0_attn2_to_q_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 320, 1, 1])];
            tensor<fp16, [2, 320, 1, 4096]> q_3_cast = conv(dilations = var_280, groups = var_111, pad = q_3_pad_0, pad_type = q_3_pad_type_0, strides = var_278, weight = down_blocks_0_attentions_0_transformer_blocks_0_attn2_to_q_weight_to_fp16_palettized, x = hidden_states_11_cast)[name = tensor<string, []>("q_3_cast")];
            tensor<int32, [2]> var_284 = const()[name = tensor<string, []>("op_284"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_286 = const()[name = tensor<string, []>("op_286"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> k_3_pad_type_0 = const()[name = tensor<string, []>("k_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> k_3_pad_0 = const()[name = tensor<string, []>("k_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 1024, 1, 1]> down_blocks_0_attentions_0_transformer_blocks_0_attn2_to_k_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [245760]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3716480))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3962304))), name = tensor<string, []>("down_blocks_0_attentions_0_transformer_blocks_0_attn2_to_k_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 1024, 1, 1])];
            tensor<fp16, [2, 320, 1, 77]> k_3_cast = conv(dilations = var_286, groups = var_111, pad = k_3_pad_0, pad_type = k_3_pad_type_0, strides = var_284, weight = down_blocks_0_attentions_0_transformer_blocks_0_attn2_to_k_weight_to_fp16_palettized, x = encoder_hidden_states)[name = tensor<string, []>("k_3_cast")];
            tensor<int32, [2]> var_290 = const()[name = tensor<string, []>("op_290"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_292 = const()[name = tensor<string, []>("op_292"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> v_3_pad_type_0 = const()[name = tensor<string, []>("v_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> v_3_pad_0 = const()[name = tensor<string, []>("v_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 1024, 1, 1]> down_blocks_0_attentions_0_transformer_blocks_0_attn2_to_v_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [245760]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3962496))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4208320))), name = tensor<string, []>("down_blocks_0_attentions_0_transformer_blocks_0_attn2_to_v_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 1024, 1, 1])];
            tensor<fp16, [2, 320, 1, 77]> v_3_cast = conv(dilations = var_292, groups = var_111, pad = v_3_pad_0, pad_type = v_3_pad_type_0, strides = var_290, weight = down_blocks_0_attentions_0_transformer_blocks_0_attn2_to_v_weight_to_fp16_palettized, x = encoder_hidden_states)[name = tensor<string, []>("v_3_cast")];
            tensor<int32, [4]> var_296 = const()[name = tensor<string, []>("op_296"), val = tensor<int32, [4]>([2, 5, 64, -1])];
            tensor<fp16, [2, 5, 64, 4096]> var_297_cast = reshape(shape = var_296, x = q_3_cast)[name = tensor<string, []>("op_297_cast")];
            tensor<int32, [4]> var_298 = const()[name = tensor<string, []>("op_298"), val = tensor<int32, [4]>([2, 5, 64, -1])];
            tensor<fp16, [2, 5, 64, 77]> var_299_cast = reshape(shape = var_298, x = k_3_cast)[name = tensor<string, []>("op_299_cast")];
            tensor<int32, [4]> var_300 = const()[name = tensor<string, []>("op_300"), val = tensor<int32, [4]>([2, 5, 64, -1])];
            tensor<fp16, [2, 5, 64, 77]> var_301_cast = reshape(shape = var_300, x = v_3_cast)[name = tensor<string, []>("op_301_cast")];
            tensor<bool, []> attn_weights_5_transpose_x_0 = const()[name = tensor<string, []>("attn_weights_5_transpose_x_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> attn_weights_5_transpose_y_0 = const()[name = tensor<string, []>("attn_weights_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 5, 4096, 77]> attn_weights_5_cast = matmul(transpose_x = attn_weights_5_transpose_x_0, transpose_y = attn_weights_5_transpose_y_0, x = var_297_cast, y = var_299_cast)[name = tensor<string, []>("attn_weights_5_cast")];
            tensor<fp16, [2, 5, 4096, 77]> attn_weights_7_cast = mul(x = attn_weights_5_cast, y = var_102_to_fp16)[name = tensor<string, []>("attn_weights_7_cast")];
            tensor<fp16, [2, 5, 4096, 77]> var_305_cast = softmax(axis = var_95, x = attn_weights_7_cast)[name = tensor<string, []>("op_305_cast")];
            tensor<bool, []> attn_3_transpose_x_0 = const()[name = tensor<string, []>("attn_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_3_transpose_y_0 = const()[name = tensor<string, []>("attn_3_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 5, 64, 4096]> attn_3_cast = matmul(transpose_x = attn_3_transpose_x_0, transpose_y = attn_3_transpose_y_0, x = var_301_cast, y = var_305_cast)[name = tensor<string, []>("attn_3_cast")];
            tensor<int32, [4]> var_309 = const()[name = tensor<string, []>("op_309"), val = tensor<int32, [4]>([2, 320, 1, -1])];
            tensor<fp16, [2, 320, 1, 4096]> input_27_cast = reshape(shape = var_309, x = attn_3_cast)[name = tensor<string, []>("input_27_cast")];
            tensor<int32, [2]> var_314 = const()[name = tensor<string, []>("op_314"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_316 = const()[name = tensor<string, []>("op_316"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> var_318_pad_type_0 = const()[name = tensor<string, []>("op_318_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_318_pad_0 = const()[name = tensor<string, []>("op_318_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
