program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.30.0"}, {"coremlc-version", "1839.0.0"}})]
{
    func main<ios16>(tensor<fp16, [2, 1024, 1, 77]> encoder_hidden_states, tensor<fp16, [2, 4, 64, 64]> sample, tensor<fp16, [2]> timestep) {
            tensor<int32, []> var_25 = const()[name = tensor<string, []>("op_25"), val = tensor<int32, []>(-1)];
            tensor<int32, [1]> var_42_axes_0 = const()[name = tensor<string, []>("op_42_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [2, 1]> var_42_cast = expand_dims(axes = var_42_axes_0, x = timestep)[name = tensor<string, []>("op_42_cast")];
            tensor<fp16, [1, 160]> var_44_to_fp16 = const()[name = tensor<string, []>("op_44_to_fp16"), val = tensor<fp16, [1, 160]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [2, 160]> emb_3_cast = mul(x = var_42_cast, y = var_44_to_fp16)[name = tensor<string, []>("emb_3_cast")];
            tensor<fp16, [2, 160]> var_49_cast = sin(x = emb_3_cast)[name = tensor<string, []>("op_49_cast")];
            tensor<fp16, [2, 160]> var_50_cast = cos(x = emb_3_cast)[name = tensor<string, []>("op_50_cast")];
            tensor<bool, []> emb_interleave_0 = const()[name = tensor<string, []>("emb_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 320]> emb_cast = concat(axis = var_25, interleave = emb_interleave_0, values = (var_49_cast, var_50_cast))[name = tensor<string, []>("emb_cast")];
            tensor<int32, [2]> var_54_begin_0 = const()[name = tensor<string, []>("op_54_begin_0"), val = tensor<int32, [2]>([0, 160])];
            tensor<int32, [2]> var_54_end_0 = const()[name = tensor<string, []>("op_54_end_0"), val = tensor<int32, [2]>([2, 320])];
            tensor<bool, [2]> var_54_end_mask_0 = const()[name = tensor<string, []>("op_54_end_mask_0"), val = tensor<bool, [2]>([true, true])];
            tensor<fp16, [2, 160]> var_54_cast = slice_by_index(begin = var_54_begin_0, end = var_54_end_0, end_mask = var_54_end_mask_0, x = emb_cast)[name = tensor<string, []>("op_54_cast")];
            tensor<int32, [2]> var_56_begin_0 = const()[name = tensor<string, []>("op_56_begin_0"), val = tensor<int32, [2]>([0, 0])];
            tensor<int32, [2]> var_56_end_0 = const()[name = tensor<string, []>("op_56_end_0"), val = tensor<int32, [2]>([2, 160])];
            tensor<bool, [2]> var_56_end_mask_0 = const()[name = tensor<string, []>("op_56_end_mask_0"), val = tensor<bool, [2]>([true, false])];
            tensor<fp16, [2, 160]> var_56_cast = slice_by_index(begin = var_56_begin_0, end = var_56_end_0, end_mask = var_56_end_mask_0, x = emb_cast)[name = tensor<string, []>("op_56_cast")];
            tensor<bool, []> sample_interleave_0 = const()[name = tensor<string, []>("sample_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [2, 320]> sample_cast = concat(axis = var_25, interleave = sample_interleave_0, values = (var_54_cast, var_56_cast))[name = tensor<string, []>("sample_cast")];
            tensor<int32, []> var_59 = const()[name = tensor<string, []>("op_59"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> var_66_axes_0 = const()[name = tensor<string, []>("op_66_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [2, 320, 1]> var_66_cast = expand_dims(axes = var_66_axes_0, x = sample_cast)[name = tensor<string, []>("op_66_cast")];
            tensor<int32, [1]> input_1_axes_0 = const()[name = tensor<string, []>("input_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [2, 320, 1, 1]> input_1_cast = expand_dims(axes = input_1_axes_0, x = var_66_cast)[name = tensor<string, []>("input_1_cast")];
            tensor<int32, [2]> var_70 = const()[name = tensor<string, []>("op_70"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_72 = const()[name = tensor<string, []>("op_72"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_3_pad_type_0 = const()[name = tensor<string, []>("input_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_3_pad_0 = const()[name = tensor<string, []>("input_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 320, 1, 1]> time_embedding_linear_1_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [307200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(448))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(307712))), name = tensor<string, []>("time_embedding_linear_1_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 320, 1, 1])];
            tensor<fp16, [1280]> time_embedding_linear_1_bias_to_fp16 = const()[name = tensor<string, []>("time_embedding_linear_1_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(307904)))];
            tensor<fp16, [2, 1280, 1, 1]> input_3_cast = conv(bias = time_embedding_linear_1_bias_to_fp16, dilations = var_72, groups = var_59, pad = input_3_pad_0, pad_type = input_3_pad_type_0, strides = var_70, weight = time_embedding_linear_1_weight_to_fp16_palettized, x = input_1_cast)[name = tensor<string, []>("input_3_cast")];
            tensor<fp16, [2, 1280, 1, 1]> input_5_cast = silu(x = input_3_cast)[name = tensor<string, []>("input_5_cast")];
            tensor<int32, [2]> var_78 = const()[name = tensor<string, []>("op_78"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_80 = const()[name = tensor<string, []>("op_80"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [1280, 1280, 1, 1]> time_embedding_linear_2_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [1228800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(310528))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1539392))), name = tensor<string, []>("time_embedding_linear_2_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([1280, 1280, 1, 1])];
            tensor<fp16, [1280]> time_embedding_linear_2_bias_to_fp16 = const()[name = tensor<string, []>("time_embedding_linear_2_bias_to_fp16"), val = tensor<fp16, [1280]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1539584)))];
            tensor<fp16, [2, 1280, 1, 1]> input_13_cast = conv(bias = time_embedding_linear_2_bias_to_fp16, dilations = var_80, groups = var_59, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = var_78, weight = time_embedding_linear_2_weight_to_fp16_palettized, x = input_5_cast)[name = tensor<string, []>("input_13_cast")];
            tensor<int32, []> var_86 = const()[name = tensor<string, []>("op_86"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_89 = const()[name = tensor<string, []>("op_89"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_91 = const()[name = tensor<string, []>("op_91"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_7_pad_type_0 = const()[name = tensor<string, []>("input_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_7_pad_0 = const()[name = tensor<string, []>("input_7_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [320, 4, 3, 3]> conv_in_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [8640]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1542208))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1550912))), name = tensor<string, []>("conv_in_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 4, 3, 3])];
            tensor<fp16, [320]> conv_in_bias_to_fp16 = const()[name = tensor<string, []>("conv_in_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1551104)))];
            tensor<fp16, [2, 320, 64, 64]> input_7_cast = conv(bias = conv_in_bias_to_fp16, dilations = var_91, groups = var_86, pad = input_7_pad_0, pad_type = input_7_pad_type_0, strides = var_89, weight = conv_in_weight_to_fp16_palettized, x = sample)[name = tensor<string, []>("input_7_cast")];
            tensor<int32, []> var_95 = const()[name = tensor<string, []>("op_95"), val = tensor<int32, []>(3)];
            tensor<bool, []> var_115 = const()[name = tensor<string, []>("op_115"), val = tensor<bool, []>(true)];
            tensor<int32, []> var_120 = const()[name = tensor<string, []>("op_120"), val = tensor<int32, []>(1)];
            tensor<int32, [5]> reshape_0_shape_0 = const()[name = tensor<string, []>("reshape_0_shape_0"), val = tensor<int32, [5]>([2, 32, 10, 64, 64])];
            tensor<fp16, [2, 32, 10, 64, 64]> reshape_0_cast = reshape(shape = reshape_0_shape_0, x = input_7_cast)[name = tensor<string, []>("reshape_0_cast")];
            tensor<int32, [3]> reduce_mean_0_axes_0 = const()[name = tensor<string, []>("reduce_mean_0_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_0_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_0_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_0_cast = reduce_mean(axes = reduce_mean_0_axes_0, keep_dims = reduce_mean_0_keep_dims_0, x = reshape_0_cast)[name = tensor<string, []>("reduce_mean_0_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> sub_0_cast = sub(x = reshape_0_cast, y = reduce_mean_0_cast)[name = tensor<string, []>("sub_0_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> square_0_cast = square(x = sub_0_cast)[name = tensor<string, []>("square_0_cast")];
            tensor<int32, [3]> reduce_mean_2_axes_0 = const()[name = tensor<string, []>("reduce_mean_2_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_2_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_2_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_2_cast = reduce_mean(axes = reduce_mean_2_axes_0, keep_dims = reduce_mean_2_keep_dims_0, x = square_0_cast)[name = tensor<string, []>("reduce_mean_2_cast")];
            tensor<fp16, []> add_0_y_0_to_fp16 = const()[name = tensor<string, []>("add_0_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_0_cast = add(x = reduce_mean_2_cast, y = add_0_y_0_to_fp16)[name = tensor<string, []>("add_0_cast")];
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_0_cast = sqrt(x = add_0_cast)[name = tensor<string, []>("sqrt_0_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> real_div_0_cast = real_div(x = sub_0_cast, y = sqrt_0_cast)[name = tensor<string, []>("real_div_0_cast")];
            tensor<int32, [4]> reshape_1_shape_0 = const()[name = tensor<string, []>("reshape_1_shape_0"), val = tensor<int32, [4]>([2, 320, 64, 64])];
            tensor<fp16, [2, 320, 64, 64]> reshape_1_cast = reshape(shape = reshape_1_shape_0, x = real_div_0_cast)[name = tensor<string, []>("reshape_1_cast")];
            tensor<fp16, [320]> add_1_mean_0_to_fp16 = const()[name = tensor<string, []>("add_1_mean_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1551808)))];
            tensor<fp16, [320]> add_1_variance_0_to_fp16 = const()[name = tensor<string, []>("add_1_variance_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1552512)))];
            tensor<fp16, [320]> add_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_1_gamma_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1553216)))];
            tensor<fp16, [320]> add_1_beta_0_to_fp16 = const()[name = tensor<string, []>("add_1_beta_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1553920)))];
            tensor<fp16, []> add_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 320, 64, 64]> add_1_cast = batch_norm(beta = add_1_beta_0_to_fp16, epsilon = add_1_epsilon_0_to_fp16, gamma = add_1_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_1_cast)[name = tensor<string, []>("add_1_cast")];
            tensor<fp16, [2, 320, 64, 64]> input_11_cast = silu(x = add_1_cast)[name = tensor<string, []>("input_11_cast")];
            tensor<int32, [2]> var_142 = const()[name = tensor<string, []>("op_142"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_144 = const()[name = tensor<string, []>("op_144"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_1_pad_type_0 = const()[name = tensor<string, []>("hidden_states_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_1_pad_0 = const()[name = tensor<string, []>("hidden_states_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [320, 320, 3, 3]> down_blocks_0_resnets_0_conv1_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [691200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1554624))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2245888))), name = tensor<string, []>("down_blocks_0_resnets_0_conv1_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 320, 3, 3])];
            tensor<fp16, [320]> down_blocks_0_resnets_0_conv1_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_conv1_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2246080)))];
            tensor<fp16, [2, 320, 64, 64]> hidden_states_1_cast = conv(bias = down_blocks_0_resnets_0_conv1_bias_to_fp16, dilations = var_144, groups = var_120, pad = hidden_states_1_pad_0, pad_type = hidden_states_1_pad_type_0, strides = var_142, weight = down_blocks_0_resnets_0_conv1_weight_to_fp16_palettized, x = input_11_cast)[name = tensor<string, []>("hidden_states_1_cast")];
            tensor<fp16, [2, 1280, 1, 1]> input_15_cast = silu(x = input_13_cast)[name = tensor<string, []>("input_15_cast")];
            tensor<int32, [2]> var_150 = const()[name = tensor<string, []>("op_150"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_152 = const()[name = tensor<string, []>("op_152"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> temb_1_pad_type_0 = const()[name = tensor<string, []>("temb_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> temb_1_pad_0 = const()[name = tensor<string, []>("temb_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 1280, 1, 1]> down_blocks_0_resnets_0_time_emb_proj_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [307200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2246784))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2554048))), name = tensor<string, []>("down_blocks_0_resnets_0_time_emb_proj_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 1280, 1, 1])];
            tensor<fp16, [320]> down_blocks_0_resnets_0_time_emb_proj_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_time_emb_proj_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2554240)))];
            tensor<fp16, [2, 320, 1, 1]> temb_1_cast = conv(bias = down_blocks_0_resnets_0_time_emb_proj_bias_to_fp16, dilations = var_152, groups = var_120, pad = temb_1_pad_0, pad_type = temb_1_pad_type_0, strides = var_150, weight = down_blocks_0_resnets_0_time_emb_proj_weight_to_fp16_palettized, x = input_15_cast)[name = tensor<string, []>("temb_1_cast")];
            tensor<fp16, [2, 320, 64, 64]> input_17_cast = add(x = hidden_states_1_cast, y = temb_1_cast)[name = tensor<string, []>("input_17_cast")];
            tensor<int32, [5]> reshape_4_shape_0 = const()[name = tensor<string, []>("reshape_4_shape_0"), val = tensor<int32, [5]>([2, 32, 10, 64, 64])];
            tensor<fp16, [2, 32, 10, 64, 64]> reshape_4_cast = reshape(shape = reshape_4_shape_0, x = input_17_cast)[name = tensor<string, []>("reshape_4_cast")];
            tensor<int32, [3]> reduce_mean_3_axes_0 = const()[name = tensor<string, []>("reduce_mean_3_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_3_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_3_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_3_cast = reduce_mean(axes = reduce_mean_3_axes_0, keep_dims = reduce_mean_3_keep_dims_0, x = reshape_4_cast)[name = tensor<string, []>("reduce_mean_3_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> sub_2_cast = sub(x = reshape_4_cast, y = reduce_mean_3_cast)[name = tensor<string, []>("sub_2_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> square_1_cast = square(x = sub_2_cast)[name = tensor<string, []>("square_1_cast")];
            tensor<int32, [3]> reduce_mean_5_axes_0 = const()[name = tensor<string, []>("reduce_mean_5_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_5_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_5_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_5_cast = reduce_mean(axes = reduce_mean_5_axes_0, keep_dims = reduce_mean_5_keep_dims_0, x = square_1_cast)[name = tensor<string, []>("reduce_mean_5_cast")];
            tensor<fp16, []> add_2_y_0_to_fp16 = const()[name = tensor<string, []>("add_2_y_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_2_cast = add(x = reduce_mean_5_cast, y = add_2_y_0_to_fp16)[name = tensor<string, []>("add_2_cast")];
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_1_cast = sqrt(x = add_2_cast)[name = tensor<string, []>("sqrt_1_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> real_div_1_cast = real_div(x = sub_2_cast, y = sqrt_1_cast)[name = tensor<string, []>("real_div_1_cast")];
            tensor<int32, [4]> reshape_5_shape_0 = const()[name = tensor<string, []>("reshape_5_shape_0"), val = tensor<int32, [4]>([2, 320, 64, 64])];
            tensor<fp16, [2, 320, 64, 64]> reshape_5_cast = reshape(shape = reshape_5_shape_0, x = real_div_1_cast)[name = tensor<string, []>("reshape_5_cast")];
            tensor<fp16, [320]> add_3_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_3_gamma_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2554944)))];
            tensor<fp16, [320]> add_3_beta_0_to_fp16 = const()[name = tensor<string, []>("add_3_beta_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2555648)))];
            tensor<fp16, []> add_3_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_3_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 320, 64, 64]> add_3_cast = batch_norm(beta = add_3_beta_0_to_fp16, epsilon = add_3_epsilon_0_to_fp16, gamma = add_3_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_5_cast)[name = tensor<string, []>("add_3_cast")];
            tensor<fp16, [2, 320, 64, 64]> input_21_cast = silu(x = add_3_cast)[name = tensor<string, []>("input_21_cast")];
            tensor<int32, [2]> var_162 = const()[name = tensor<string, []>("op_162"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_164 = const()[name = tensor<string, []>("op_164"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_3_pad_type_0 = const()[name = tensor<string, []>("hidden_states_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_3_pad_0 = const()[name = tensor<string, []>("hidden_states_3_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [320, 320, 3, 3]> down_blocks_0_resnets_0_conv2_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [691200]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2556352))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3247616))), name = tensor<string, []>("down_blocks_0_resnets_0_conv2_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 320, 3, 3])];
            tensor<fp16, [320]> down_blocks_0_resnets_0_conv2_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_resnets_0_conv2_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3247808)))];
            tensor<fp16, [2, 320, 64, 64]> hidden_states_3_cast = conv(bias = down_blocks_0_resnets_0_conv2_bias_to_fp16, dilations = var_164, groups = var_120, pad = hidden_states_3_pad_0, pad_type = hidden_states_3_pad_type_0, strides = var_162, weight = down_blocks_0_resnets_0_conv2_weight_to_fp16_palettized, x = input_21_cast)[name = tensor<string, []>("hidden_states_3_cast")];
            tensor<fp16, [2, 320, 64, 64]> hidden_states_5_cast = add(x = input_7_cast, y = hidden_states_3_cast)[name = tensor<string, []>("hidden_states_5_cast")];
            tensor<int32, [5]> reshape_8_shape_0 = const()[name = tensor<string, []>("reshape_8_shape_0"), val = tensor<int32, [5]>([2, 32, 10, 64, 64])];
            tensor<fp16, [2, 32, 10, 64, 64]> reshape_8_cast = reshape(shape = reshape_8_shape_0, x = hidden_states_5_cast)[name = tensor<string, []>("reshape_8_cast")];
            tensor<int32, [3]> reduce_mean_6_axes_0 = const()[name = tensor<string, []>("reduce_mean_6_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_6_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_6_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_6_cast = reduce_mean(axes = reduce_mean_6_axes_0, keep_dims = reduce_mean_6_keep_dims_0, x = reshape_8_cast)[name = tensor<string, []>("reduce_mean_6_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> sub_4_cast = sub(x = reshape_8_cast, y = reduce_mean_6_cast)[name = tensor<string, []>("sub_4_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> square_2_cast = square(x = sub_4_cast)[name = tensor<string, []>("square_2_cast")];
            tensor<int32, [3]> reduce_mean_8_axes_0 = const()[name = tensor<string, []>("reduce_mean_8_axes_0"), val = tensor<int32, [3]>([2, 3, 4])];
            tensor<bool, []> reduce_mean_8_keep_dims_0 = const()[name = tensor<string, []>("reduce_mean_8_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [2, 32, 1, 1, 1]> reduce_mean_8_cast = reduce_mean(axes = reduce_mean_8_axes_0, keep_dims = reduce_mean_8_keep_dims_0, x = square_2_cast)[name = tensor<string, []>("reduce_mean_8_cast")];
            tensor<fp16, []> add_4_y_0_to_fp16 = const()[name = tensor<string, []>("add_4_y_0_to_fp16"), val = tensor<fp16, []>(0x1.1p-20)];
            tensor<fp16, [2, 32, 1, 1, 1]> add_4_cast = add(x = reduce_mean_8_cast, y = add_4_y_0_to_fp16)[name = tensor<string, []>("add_4_cast")];
            tensor<fp16, [2, 32, 1, 1, 1]> sqrt_2_cast = sqrt(x = add_4_cast)[name = tensor<string, []>("sqrt_2_cast")];
            tensor<fp16, [2, 32, 10, 64, 64]> real_div_2_cast = real_div(x = sub_4_cast, y = sqrt_2_cast)[name = tensor<string, []>("real_div_2_cast")];
            tensor<int32, [4]> reshape_9_shape_0 = const()[name = tensor<string, []>("reshape_9_shape_0"), val = tensor<int32, [4]>([2, 320, 64, 64])];
            tensor<fp16, [2, 320, 64, 64]> reshape_9_cast = reshape(shape = reshape_9_shape_0, x = real_div_2_cast)[name = tensor<string, []>("reshape_9_cast")];
            tensor<fp16, [320]> add_5_gamma_0_to_fp16 = const()[name = tensor<string, []>("add_5_gamma_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3248512)))];
            tensor<fp16, [320]> add_5_beta_0_to_fp16 = const()[name = tensor<string, []>("add_5_beta_0_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3249216)))];
            tensor<fp16, []> add_5_epsilon_0_to_fp16 = const()[name = tensor<string, []>("add_5_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 320, 64, 64]> add_5_cast = batch_norm(beta = add_5_beta_0_to_fp16, epsilon = add_5_epsilon_0_to_fp16, gamma = add_5_gamma_0_to_fp16, mean = add_1_mean_0_to_fp16, variance = add_1_variance_0_to_fp16, x = reshape_9_cast)[name = tensor<string, []>("add_5_cast")];
            tensor<int32, [2]> var_184 = const()[name = tensor<string, []>("op_184"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_186 = const()[name = tensor<string, []>("op_186"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> hidden_states_7_pad_type_0 = const()[name = tensor<string, []>("hidden_states_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> hidden_states_7_pad_0 = const()[name = tensor<string, []>("hidden_states_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 320, 1, 1]> down_blocks_0_attentions_0_proj_in_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [76800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3249920))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3326784))), name = tensor<string, []>("down_blocks_0_attentions_0_proj_in_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 320, 1, 1])];
            tensor<fp16, [320]> down_blocks_0_attentions_0_proj_in_bias_to_fp16 = const()[name = tensor<string, []>("down_blocks_0_attentions_0_proj_in_bias_to_fp16"), val = tensor<fp16, [320]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3326976)))];
            tensor<fp16, [2, 320, 64, 64]> hidden_states_7_cast = conv(bias = down_blocks_0_attentions_0_proj_in_bias_to_fp16, dilations = var_186, groups = var_120, pad = hidden_states_7_pad_0, pad_type = hidden_states_7_pad_type_0, strides = var_184, weight = down_blocks_0_attentions_0_proj_in_weight_to_fp16_palettized, x = add_5_cast)[name = tensor<string, []>("hidden_states_7_cast")];
            tensor<int32, [4]> var_191 = const()[name = tensor<string, []>("op_191"), val = tensor<int32, [4]>([2, 320, 1, 4096])];
            tensor<fp16, [2, 320, 1, 4096]> inputs_1_cast = reshape(shape = var_191, x = hidden_states_7_cast)[name = tensor<string, []>("inputs_1_cast")];
            tensor<int32, [1]> var_201 = const()[name = tensor<string, []>("op_201"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [2, 1, 1, 4096]> channels_mean_1_cast = reduce_mean(axes = var_201, keep_dims = var_115, x = inputs_1_cast)[name = tensor<string, []>("channels_mean_1_cast")];
            tensor<fp16, [2, 320, 1, 4096]> zero_mean_1_cast = sub(x = inputs_1_cast, y = channels_mean_1_cast)[name = tensor<string, []>("zero_mean_1_cast")];
            tensor<fp16, [2, 320, 1, 4096]> zero_mean_sq_1_cast = mul(x = zero_mean_1_cast, y = zero_mean_1_cast)[name = tensor<string, []>("zero_mean_sq_1_cast")];
            tensor<int32, [1]> var_205 = const()[name = tensor<string, []>("op_205"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [2, 1, 1, 4096]> var_206_cast = reduce_mean(axes = var_205, keep_dims = var_115, x = zero_mean_sq_1_cast)[name = tensor<string, []>("op_206_cast")];
            tensor<fp16, []> var_207_to_fp16 = const()[name = tensor<string, []>("op_207_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [2, 1, 1, 4096]> var_208_cast = add(x = var_206_cast, y = var_207_to_fp16)[name = tensor<string, []>("op_208_cast")];
            tensor<fp16, []> denom_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("denom_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [2, 1, 1, 4096]> denom_1_cast = rsqrt(epsilon = denom_1_epsilon_0_to_fp16, x = var_208_cast)[name = tensor<string, []>("denom_1_cast")];
            tensor<fp16, [2, 320, 1, 4096]> out_1_cast = mul(x = zero_mean_1_cast, y = denom_1_cast)[name = tensor<string, []>("out_1_cast")];
            tensor<fp16, [1, 320, 1, 1]> var_212_to_fp16 = const()[name = tensor<string, []>("op_212_to_fp16"), val = tensor<fp16, [1, 320, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3327680)))];
            tensor<fp16, [2, 320, 1, 4096]> var_213_cast = add(x = out_1_cast, y = var_212_to_fp16)[name = tensor<string, []>("op_213_cast")];
            tensor<fp16, [1, 320, 1, 1]> var_215_to_fp16 = const()[name = tensor<string, []>("op_215_to_fp16"), val = tensor<fp16, [1, 320, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3328384)))];
            tensor<fp16, [2, 320, 1, 4096]> hidden_states_9_cast = mul(x = var_213_cast, y = var_215_to_fp16)[name = tensor<string, []>("hidden_states_9_cast")];
            tensor<int32, [2]> var_222 = const()[name = tensor<string, []>("op_222"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_224 = const()[name = tensor<string, []>("op_224"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> q_1_pad_type_0 = const()[name = tensor<string, []>("q_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> q_1_pad_0 = const()[name = tensor<string, []>("q_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 320, 1, 1]> down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_q_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [76800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3329088))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3405952))), name = tensor<string, []>("down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_q_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 320, 1, 1])];
            tensor<fp16, [2, 320, 1, 4096]> q_1_cast = conv(dilations = var_224, groups = var_120, pad = q_1_pad_0, pad_type = q_1_pad_type_0, strides = var_222, weight = down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_q_weight_to_fp16_palettized, x = hidden_states_9_cast)[name = tensor<string, []>("q_1_cast")];
            tensor<int32, [2]> var_228 = const()[name = tensor<string, []>("op_228"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_230 = const()[name = tensor<string, []>("op_230"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> k_1_pad_type_0 = const()[name = tensor<string, []>("k_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> k_1_pad_0 = const()[name = tensor<string, []>("k_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 320, 1, 1]> down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_k_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [76800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3406144))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3483008))), name = tensor<string, []>("down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_k_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 320, 1, 1])];
            tensor<fp16, [2, 320, 1, 4096]> k_1_cast = conv(dilations = var_230, groups = var_120, pad = k_1_pad_0, pad_type = k_1_pad_type_0, strides = var_228, weight = down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_k_weight_to_fp16_palettized, x = hidden_states_9_cast)[name = tensor<string, []>("k_1_cast")];
            tensor<int32, [2]> var_234 = const()[name = tensor<string, []>("op_234"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_236 = const()[name = tensor<string, []>("op_236"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> v_1_pad_type_0 = const()[name = tensor<string, []>("v_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> v_1_pad_0 = const()[name = tensor<string, []>("v_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [320, 320, 1, 1]> down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_v_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [76800]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3483200))), lut = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3560064))), name = tensor<string, []>("down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_v_weight_to_fp16_palettized"), shape = tensor<uint32, [4]>([320, 320, 1, 1])];
            tensor<fp16, [2, 320, 1, 4096]> v_1_cast = conv(dilations = var_236, groups = var_120, pad = v_1_pad_0, pad_type = v_1_pad_type_0, strides = var_234, weight = down_blocks_0_attentions_0_transformer_blocks_0_attn1_to_v_weight_to_fp16_palettized, x = hidden_states_9_cast)[name = tensor<string, []>("v_1_cast")];
            tensor<int32, [4]> var_240_begin_0 = const()[name = tensor<string, []>("op_240_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_240_end_0 = const()[name = tensor<string, []>("op_240_end_0"), val = tensor<int32, [4]>([2, 64, 1, 4096])];
            tensor<bool, [4]> var_240_end_mask_0 = const()[name = tensor<string, []>("op_240_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 64, 1, 4096]> var_240_cast = slice_by_index(begin = var_240_begin_0, end = var_240_end_0, end_mask = var_240_end_mask_0, x = q_1_cast)[name = tensor<string, []>("op_240_cast")];
            tensor<int32, [4]> var_244_begin_0 = const()[name = tensor<string, []>("op_244_begin_0"), val = tensor<int32, [4]>([0, 64, 0, 0])];
            tensor<int32, [4]> var_244_end_0 = const()[name = tensor<string, []>("op_244_end_0"), val = tensor<int32, [4]>([2, 128, 1, 4096])];
            tensor<bool, [4]> var_244_end_mask_0 = const()[name = tensor<string, []>("op_244_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 64, 1, 4096]> var_244_cast = slice_by_index(begin = var_244_begin_0, end = var_244_end_0, end_mask = var_244_end_mask_0, x = q_1_cast)[name = tensor<string, []>("op_244_cast")];
            tensor<int32, [4]> var_248_begin_0 = const()[name = tensor<string, []>("op_248_begin_0"), val = tensor<int32, [4]>([0, 128, 0, 0])];
            tensor<int32, [4]> var_248_end_0 = const()[name = tensor<string, []>("op_248_end_0"), val = tensor<int32, [4]>([2, 192, 1, 4096])];
            tensor<bool, [4]> var_248_end_mask_0 = const()[name = tensor<string, []>("op_248_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 64, 1, 4096]> var_248_cast = slice_by_index(begin = var_248_begin_0, end = var_248_end_0, end_mask = var_248_end_mask_0, x = q_1_cast)[name = tensor<string, []>("op_248_cast")];
            tensor<int32, [4]> var_252_begin_0 = const()[name = tensor<string, []>("op_252_begin_0"), val = tensor<int32, [4]>([0, 192, 0, 0])];
            tensor<int32, [4]> var_252_end_0 = const()[name = tensor<string, []>("op_252_end_0"), val = tensor<int32, [4]>([2, 256, 1, 4096])];
            tensor<bool, [4]> var_252_end_mask_0 = const()[name = tensor<string, []>("op_252_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 64, 1, 4096]> var_252_cast = slice_by_index(begin = var_252_begin_0, end = var_252_end_0, end_mask = var_252_end_mask_0, x = q_1_cast)[name = tensor<string, []>("op_252_cast")];
            tensor<int32, [4]> var_256_begin_0 = const()[name = tensor<string, []>("op_256_begin_0"), val = tensor<int32, [4]>([0, 256, 0, 0])];
            tensor<int32, [4]> var_256_end_0 = const()[name = tensor<string, []>("op_256_end_0"), val = tensor<int32, [4]>([2, 320, 1, 4096])];
            tensor<bool, [4]> var_256_end_mask_0 = const()[name = tensor<string, []>("op_256_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [2, 64, 1, 4096]> var_256_cast = slice_by_index(begin = var_256_begin_0, end = var_256_end_0, end_mask = var_256_end_mask_0, x = q_1_cast)[name = tensor<string, []>("op_256_cast")];
            tensor<int32, [4]> var_259_begin_0 = const()[name = tensor<string, []>("op_259_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_259_end_0 = const()[name = tensor<string, []>("op_259_end_0"), val = tensor<int32, [4]>([2, 64, 1, 512])];
            tensor<bool, [4]> var_259_end_mask_0 = const()[name = tensor<string, []>("op_259_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_259_cast = slice_by_index(begin = var_259_begin_0, end = var_259_end_0, end_mask = var_259_end_mask_0, x = var_240_cast)[name = tensor<string, []>("op_259_cast")];
            tensor<int32, [4]> var_260_begin_0 = const()[name = tensor<string, []>("op_260_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 512])];
            tensor<int32, [4]> var_260_end_0 = const()[name = tensor<string, []>("op_260_end_0"), val = tensor<int32, [4]>([2, 64, 1, 1024])];
            tensor<bool, [4]> var_260_end_mask_0 = const()[name = tensor<string, []>("op_260_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_260_cast = slice_by_index(begin = var_260_begin_0, end = var_260_end_0, end_mask = var_260_end_mask_0, x = var_240_cast)[name = tensor<string, []>("op_260_cast")];
            tensor<int32, [4]> var_261_begin_0 = const()[name = tensor<string, []>("op_261_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1024])];
            tensor<int32, [4]> var_261_end_0 = const()[name = tensor<string, []>("op_261_end_0"), val = tensor<int32, [4]>([2, 64, 1, 1536])];
            tensor<bool, [4]> var_261_end_mask_0 = const()[name = tensor<string, []>("op_261_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_261_cast = slice_by_index(begin = var_261_begin_0, end = var_261_end_0, end_mask = var_261_end_mask_0, x = var_240_cast)[name = tensor<string, []>("op_261_cast")];
            tensor<int32, [4]> var_262_begin_0 = const()[name = tensor<string, []>("op_262_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1536])];
            tensor<int32, [4]> var_262_end_0 = const()[name = tensor<string, []>("op_262_end_0"), val = tensor<int32, [4]>([2, 64, 1, 2048])];
            tensor<bool, [4]> var_262_end_mask_0 = const()[name = tensor<string, []>("op_262_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_262_cast = slice_by_index(begin = var_262_begin_0, end = var_262_end_0, end_mask = var_262_end_mask_0, x = var_240_cast)[name = tensor<string, []>("op_262_cast")];
            tensor<int32, [4]> var_263_begin_0 = const()[name = tensor<string, []>("op_263_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 2048])];
            tensor<int32, [4]> var_263_end_0 = const()[name = tensor<string, []>("op_263_end_0"), val = tensor<int32, [4]>([2, 64, 1, 2560])];
            tensor<bool, [4]> var_263_end_mask_0 = const()[name = tensor<string, []>("op_263_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_263_cast = slice_by_index(begin = var_263_begin_0, end = var_263_end_0, end_mask = var_263_end_mask_0, x = var_240_cast)[name = tensor<string, []>("op_263_cast")];
            tensor<int32, [4]> var_264_begin_0 = const()[name = tensor<string, []>("op_264_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 2560])];
            tensor<int32, [4]> var_264_end_0 = const()[name = tensor<string, []>("op_264_end_0"), val = tensor<int32, [4]>([2, 64, 1, 3072])];
            tensor<bool, [4]> var_264_end_mask_0 = const()[name = tensor<string, []>("op_264_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_264_cast = slice_by_index(begin = var_264_begin_0, end = var_264_end_0, end_mask = var_264_end_mask_0, x = var_240_cast)[name = tensor<string, []>("op_264_cast")];
            tensor<int32, [4]> var_265_begin_0 = const()[name = tensor<string, []>("op_265_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 3072])];
            tensor<int32, [4]> var_265_end_0 = const()[name = tensor<string, []>("op_265_end_0"), val = tensor<int32, [4]>([2, 64, 1, 3584])];
            tensor<bool, [4]> var_265_end_mask_0 = const()[name = tensor<string, []>("op_265_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_265_cast = slice_by_index(begin = var_265_begin_0, end = var_265_end_0, end_mask = var_265_end_mask_0, x = var_240_cast)[name = tensor<string, []>("op_265_cast")];
            tensor<int32, [4]> var_266_begin_0 = const()[name = tensor<string, []>("op_266_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 3584])];
            tensor<int32, [4]> var_266_end_0 = const()[name = tensor<string, []>("op_266_end_0"), val = tensor<int32, [4]>([2, 64, 1, 4096])];
            tensor<bool, [4]> var_266_end_mask_0 = const()[name = tensor<string, []>("op_266_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_266_cast = slice_by_index(begin = var_266_begin_0, end = var_266_end_0, end_mask = var_266_end_mask_0, x = var_240_cast)[name = tensor<string, []>("op_266_cast")];
            tensor<int32, [4]> var_267_begin_0 = const()[name = tensor<string, []>("op_267_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_267_end_0 = const()[name = tensor<string, []>("op_267_end_0"), val = tensor<int32, [4]>([2, 64, 1, 512])];
            tensor<bool, [4]> var_267_end_mask_0 = const()[name = tensor<string, []>("op_267_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_267_cast = slice_by_index(begin = var_267_begin_0, end = var_267_end_0, end_mask = var_267_end_mask_0, x = var_244_cast)[name = tensor<string, []>("op_267_cast")];
            tensor<int32, [4]> var_268_begin_0 = const()[name = tensor<string, []>("op_268_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 512])];
            tensor<int32, [4]> var_268_end_0 = const()[name = tensor<string, []>("op_268_end_0"), val = tensor<int32, [4]>([2, 64, 1, 1024])];
            tensor<bool, [4]> var_268_end_mask_0 = const()[name = tensor<string, []>("op_268_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_268_cast = slice_by_index(begin = var_268_begin_0, end = var_268_end_0, end_mask = var_268_end_mask_0, x = var_244_cast)[name = tensor<string, []>("op_268_cast")];
            tensor<int32, [4]> var_269_begin_0 = const()[name = tensor<string, []>("op_269_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1024])];
            tensor<int32, [4]> var_269_end_0 = const()[name = tensor<string, []>("op_269_end_0"), val = tensor<int32, [4]>([2, 64, 1, 1536])];
            tensor<bool, [4]> var_269_end_mask_0 = const()[name = tensor<string, []>("op_269_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_269_cast = slice_by_index(begin = var_269_begin_0, end = var_269_end_0, end_mask = var_269_end_mask_0, x = var_244_cast)[name = tensor<string, []>("op_269_cast")];
            tensor<int32, [4]> var_270_begin_0 = const()[name = tensor<string, []>("op_270_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1536])];
            tensor<int32, [4]> var_270_end_0 = const()[name = tensor<string, []>("op_270_end_0"), val = tensor<int32, [4]>([2, 64, 1, 2048])];
            tensor<bool, [4]> var_270_end_mask_0 = const()[name = tensor<string, []>("op_270_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_270_cast = slice_by_index(begin = var_270_begin_0, end = var_270_end_0, end_mask = var_270_end_mask_0, x = var_244_cast)[name = tensor<string, []>("op_270_cast")];
            tensor<int32, [4]> var_271_begin_0 = const()[name = tensor<string, []>("op_271_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 2048])];
            tensor<int32, [4]> var_271_end_0 = const()[name = tensor<string, []>("op_271_end_0"), val = tensor<int32, [4]>([2, 64, 1, 2560])];
            tensor<bool, [4]> var_271_end_mask_0 = const()[name = tensor<string, []>("op_271_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_271_cast = slice_by_index(begin = var_271_begin_0, end = var_271_end_0, end_mask = var_271_end_mask_0, x = var_244_cast)[name = tensor<string, []>("op_271_cast")];
            tensor<int32, [4]> var_272_begin_0 = const()[name = tensor<string, []>("op_272_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 2560])];
            tensor<int32, [4]> var_272_end_0 = const()[name = tensor<string, []>("op_272_end_0"), val = tensor<int32, [4]>([2, 64, 1, 3072])];
            tensor<bool, [4]> var_272_end_mask_0 = const()[name = tensor<string, []>("op_272_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_272_cast = slice_by_index(begin = var_272_begin_0, end = var_272_end_0, end_mask = var_272_end_mask_0, x = var_244_cast)[name = tensor<string, []>("op_272_cast")];
            tensor<int32, [4]> var_273_begin_0 = const()[name = tensor<string, []>("op_273_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 3072])];
            tensor<int32, [4]> var_273_end_0 = const()[name = tensor<string, []>("op_273_end_0"), val = tensor<int32, [4]>([2, 64, 1, 3584])];
            tensor<bool, [4]> var_273_end_mask_0 = const()[name = tensor<string, []>("op_273_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_273_cast = slice_by_index(begin = var_273_begin_0, end = var_273_end_0, end_mask = var_273_end_mask_0, x = var_244_cast)[name = tensor<string, []>("op_273_cast")];
            tensor<int32, [4]> var_274_begin_0 = const()[name = tensor<string, []>("op_274_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 3584])];
            tensor<int32, [4]> var_274_end_0 = const()[name = tensor<string, []>("op_274_end_0"), val = tensor<int32, [4]>([2, 64, 1, 4096])];
            tensor<bool, [4]> var_274_end_mask_0 = const()[name = tensor<string, []>("op_274_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_274_cast = slice_by_index(begin = var_274_begin_0, end = var_274_end_0, end_mask = var_274_end_mask_0, x = var_244_cast)[name = tensor<string, []>("op_274_cast")];
            tensor<int32, [4]> var_275_begin_0 = const()[name = tensor<string, []>("op_275_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_275_end_0 = const()[name = tensor<string, []>("op_275_end_0"), val = tensor<int32, [4]>([2, 64, 1, 512])];
            tensor<bool, [4]> var_275_end_mask_0 = const()[name = tensor<string, []>("op_275_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [2, 64, 1, 512]> var_275_cast = slice_by_index(begin = var_275_begin_0, end = var_275_end_0, end_mask = var_275_end_mask_0, x = var_248_cast)[name = tensor<string, []>("op_275_cast")];
            tensor<int32, [4]> var_276_begin_0 = const()[name = tensor<string, []>("op_276_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 512])];
            tensor<int32, [4]> var_276_end_0 = const()[name = tensor<string, []>("op_276_end_0"), val = tensor<int32, [4]>([2, 64, 1, 1024])];
            tensor<bool, [4]> var_276_end_mask_0 = const()[name = tensor<string, []>("op_276_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
